[
  {
    "id" : "CB1",
    "name" : "Clear Water Village",
    "type" : "city",
    "pos" : [197.91310119628906, 504.3006591796875],
    "lblPos" : null,
    "provinceId" : "Crab-1",
    "owner" : "crab",
    "details": {
      "html" : "<p>Although it is referred to as a &ldquo;village,&rdquo; in actuality Sunda Mizu Mura is a major city with a population of over 5,000, as well as a major commercial center for the Crab Clan. Originally controlled by the Crane Clan, the city passed into Crab hands along with the rest of the Yasuki family holdings in the third century. Clear Water Village does a booming trade on both river and sea, and its wharves and docks are always full. True to Crab tradition, it is also heavily fortified both on land and especially in the water, with extensive sea-walls and underwater barriers to obstruct any possible aquatic threat.</p>"
    }
  },
  {
    "id" : "CB2",
    "name" : "Face of the East Coast",
    "type" : "castle",
    "pos" : [79.08956909179688, 364.3006591796875],
    "lblPos" : null,
    "provinceId" : "Crab-4",
    "owner" : "crab",
    "details": {
      "background" : "assets/images/details-bg-castle-crab-3.jpg",
      "html" : "<p>This castle, also called Shiro Koatsuki no Higashi, lies on the eastern edge of the Twilight Mountains close to the Shinomen Forest. This remote location would seem to make it a place of little value, and in truth the castle has been threatened less often than almost any other Crab stronghold. For that very reason the Yasuki have made it into a major center of diplomatic relations with other clans. The distance from the Shadowlands makes it a place where other clan dignitaries can visit with little danger, and the Yasuki have worked to make Face of the East a friendlier and more pleasant castle than most Crab fortresses. Although it cannot rival the splendor of Yasuki Yashiki it is still considerably more luxurious than typical for the Crab, and clan ambassadors and dignitaries visit it regularly during the year. The castle is also a hub for overland trade (both legal and illicit) with the Unicorn Clan, whose caravans can reach it directly without passing through the strict tariff inspections of the Scorpion lands.</p>"
    }
  },
  {
    "id" : "CB3",
    "name" : "Fortress of the Forgotten",
    "type" : "castle",
    "pos" : [103.79544830322266, 488.6143798828125],
    "lblPos" : null,
    "provinceId" : "Crab-3",
    "owner" : "crab",
    "details": {
      "background" : "assets/images/details-bg-castle-crab.jpg",
      "html" : "<p>The Crab are notorious for the berserkers who appear in their ranks, men (and sometimes women) whose battle fury sweeps them away in murderous rampages that can turn the tide of a battle single-handedly. Unfortunately, the very qualities that make berserkers so formidable on the battlefield also make them very troublesome away from it. Berserkers are notorious for being crude, ill-mannered, violent, and socially reprehensible, and the Crab usually try to keep them from mingling too much with the rest of the Empire &ndash; or even the other Crab troops, whose discipline can sometimes be undermined by the temperamental berserkers. The worst of the berserkers are isolated into their own units, and when not serving on the wall these problem soldiers are garrisoned at the Fortress of the Forgotten, also known as Toride no Wasuremono. A bleak castle even by Crab standards, located in some of the most rugged and forbidding territory of the Hida provinces, the Fortress of the Forgotten is little more than a massively fortified barracks with only the most minimal requirements to maintain life and health. The Crab have been careful to locate it well away from the traders&rsquo; road that parallels the Kaiu Wall, since otherwise the off-duty berserkers would quickly poison themselves with sake and other less savory indulgences.</p>"
    }
  },
  {
    "id" : "CB4",
    "name" : "Koten",
    "type" : "temple",
    "pos" : [183.01113891601562, 515.6732177734375],
    "lblPos" : null,
    "provinceId" : "Crab-4",
    "owner" : "crab",
    "details": {
      "html" : "<h3>The Crab Ancestral Hall</h3> <p>The Crab are not known as an especially contemplative people, and few of their samurai ever choose to retire to the Brotherhood of Shinsei. However, their pragmatic lifestyle does not mean they are any less pious than the rest of the Empire, and anyone who visits Koten will understand this at once. Here, in a temple which is as well-fortified and heavily constructed as any Crab fortress, the Crab pay reverence to those who have gone before and remember their deeds for all time. Statues of Crab heroes line the walls and monks chant perpetually in mourning for the dead and the lost. There are few artifacts or mementoes here, for seldom is the Crab hero who lives to pass such things on to Koten. What is preserved here are stories, legends, and tales of Crab valor which are remembered here if nowhere else in the Empire. The monks here are always ready to listen to the stories of their visitors, to listen while a heartbroken Crab warrior tells the tale of a heroic brother, or father, or mother, or cousin. It is the preservation of these tales that the monks hold as their most sacred duty, and they perform it without fault.</p>"
    }
  },
  {
    "id" : "CB5",
    "name" : "Kyuden Hida",
    "type" : "castle",
    "pos" : [167.32485961914062, 504.3006591796875],
    "lblPos" : null,
    "provinceId" : "Crab-1",
    "owner" : "crab",
    "details": {
      "html" : "<p>Perhaps the single most formidable defensive fortress in all of Rokugan, the mighty seat of the Hida family serves as the central command post for the entire Kaiu Wall and is home to a permanent garrison of over 3,000 veteran Crab bushi. The castle is a brutally practical-looking structure, wholly free of any sort of art, decoration, or beauty. Its main gatehouse stands over 60 feet high, and the castle&rsquo;s walls are built to withstand siege from any conceivable opponent. It is located atop a high stone escarpment that offers an excellent view of the surrounding territory, and the castle&rsquo;s masonry blends seamlessly with the rugged landscape, almost as though the fortress sprouted whole from the ground. After the tumultuous eighth century, the castle does acquire one notable adornment &ndash; the skull of the Maw, cleansed of Taint and hung over the main gate as a gesture of defiance against the Shadowlands.</p>"
    }
  },
  {
    "id" : "CB6",
    "name" : "Razor of Dawn Castle",
    "type" : "castle",
    "pos" : [52.815059661865234, 386.2614440917969],
    "lblPos" : "none",
    "provinceId" : "Crab-4",
    "owner" : "crab",
    "details": {
      "html" : "<p>Located near the northern end of the Kaiu Wall, this ancient fortress in Kaiu lands was once a key defensive position for the northern Crab provinces. After the Kaiu Wall was built, Razor of the Dawn became the anchor of the Wall&rsquo;s northern flank. It is positioned between two great peaks of the Twilight Mountains, and any Shadowlands force which tries to circle around the Wall will run headlong into its formidable defenses. In point of fact, no enemy of any strength has ever threatened Razor of the Dawn, and it usually serves instead as a marshalling point for reserve forces. During the major crises of the twelfth century, such as Daigotsu&rsquo;s assault in 1158 or the Kalima invasion of 1172, Razor of the Dawn assumes a much more active role, functioning as a central marshaling point for Crab forces counterattacking against the broken Wall.</p>"
    }
  },
  {
    "id" : "CB7",
    "name" : "Shattered Peaks Castle",
    "type" : "castle",
    "pos" : [56.3444709777832, 365.47711181640625],
    "lblPos" : "none",
    "provinceId" : "Crab-4",
    "owner" : "crab",
    "details": {
      "background" : "assets/images/details-bg-castle-crab-2.jpg",
      "html" : "<p>One of the strongest of the fortifications which stand alone on the northern edge of Crab lands, Shattered Peaks is a smaller counterpart to Razor of the Dawn, located on the western side of the Twilight Mountains while Razor of the Dawn guards the eastern side. The northern edge of the Shadowlands is visible from the walls of Shattered Peaks Castle and it has turned back more than one assault from the forces of Jigoku. During the eleventh century it withstood a large-scale assault from the legions of the Dark Moto, enduring a forty-day siege before relief forces arrived to drive away the enemy. The castle suffered severe damage during the siege but never fell, and after the Shadowlands forces retreated the fortress was rebuilt stronger than before.</p>"
    }
  },
  {
    "id" : "CB8",
    "name" : "Shiro Hiruma",
    "type" : "castle",
    "pos" : [97.91309356689453, 525.4771118164062],
    "lblPos" : null,
    "provinceId" : "Shadowlands-1",
    "owner" : "shadowlands",
    "details": {
      "html" : "<p>The ancestral seat of the Hiruma family is a relatively small castle. It stood proudly unconquered until the disasters of the eighth century. After the Maw&rsquo;s legions overran the Hiruma lands this castle fell into the grasp of the Shadowlands, becoming a symbol of shame and horror to the Crab Clan. The Hiruma mounted numerous expeditions to try to retake it but all of them failed, often with bitter loss of life. Finally in the year 1130 a combined Crab army recaptured the castle. It was purged of the Taint and rebuilt to be considerably larger and stronger than before. Extensive fortifications, traps, and secondary entrenchments surround the modern castle, ensuring it will not be caught undefended as it was before.</p>"
    }
  },
  {
    "id" : "CB9",
    "name" : "Shiro Kaiu",
    "type" : "castle",
    "pos" : [55.167999267578125, 424.69281005859375],
    "lblPos" : null,
    "provinceId" : "Crab-4",
    "owner" : "crab",
    "details": {
      "html" : "<p>The seat of the Kaiu family is not quite as large and formidable a fortress as Kyuden Hida but may actually be a more intimidating obstacle to an enemy. Home to the Empire&rsquo;s premier masters of siege warfare, Shiro Kaiu boasts some of the most refined and sophisticated fortifications and siege engines ever seen in Rokugan, and no enemy has ever breached its walls despite its close proximity to the Wall. In addition to its military role Shiro Kaiu is also home to the legendary Great Forge, where the clan&rsquo;s master weaponsmiths craft some of the finest swords in the Empire. Only a few score of the fabled Kaiu blades are made each year, by craftsmen who undertake special rituals of purification before they are even allowed near the forge.</p>"
    }
  },
  {
    "id" : "CB10",
    "name" : "Shiro Kuni",
    "type" : "castle",
    "pos" : [144.971923828125, 461.16339111328125],
    "lblPos" : null,
    "provinceId" : "Crab-3",
    "owner" : "crab",
    "details": {
      "html" : "<p>The Castle of the Land, as it is sometimes called, serves more than one role for the Crab Clan. The Kuni maintain their primary dojo here, along with other facilities that include an extensive laboratory for their sinister experiments. However, the castle also serves as one of the command centers for the Kaiu Wall, and significant troops are held here in reserve to reinforce the Wall during dangerous assaults. The castle itself is relatively small in size, and like most Crab construction it is quite plain and functional in design. It is not especially well fortified, however &ndash; its role is command post, communications center, and training center, rather than defensive fortress.</p>"
    }
  },
  {
    "id" : "CB11",
    "name" : "Yasuki Yashiki",
    "type" : "castle",
    "pos" : [230.686279296875, 515.3921508789062],
    "lblPos" : null,
    "provinceId" : "Crane-6",
    "owner" : "crab",
    "details": {
      "html" : "<p>The primary home of the Yasuki family is a study in contrast with most other Crab settlements. Although it is well-fortified and as capable of withstanding attack as any other castle in Rokugan, Yasuki Yashiki is also built to be a beautiful castle, splendid to look upon, with fine gardens and a selection of splendid art from across the Empire. Although the Yasuki tend to be a bit gaudier than more restrained and traditional clans like the Crane and Scorpion, Yasuki Yashiki is nevertheless a far more comfortable and familiar place to other Rokugani than the stark, stony practicality of the Hida, Hiruma, and Kaiu castles. Major diplomatic and trade negotiations take place here every year. For samurai whose duties require them to conduct mercantile business, winning an invitation to the winter court of Yasuki Yashiki is a prize indeed.</p>"
    }
  },
  {
    "id" : "CN1",
    "name" : "Benten Seido",
    "type" : "shrine",
    "pos" : [299.0196228027344, 288.2352600097656],
    "lblPos" : null,
    "provinceId" : "Crane-1",
    "owner" : "crane",
    "details": {
      "html" : "<p>Shrines to many Fortunes, particularly the Seven Great Fortunes, are a common sight throughout the Empire. Each of the Great Clans tends to revere one of the Seven over the others, not through design but simply because of the unique philosophies to which each clan subscribes. For the Crane that Fortune is Benten, the Fortune of Romantic Love. This should not be taken to suggest the Crane believe in love above all else; far from it, for as one of the most political of clans they recognize the value of marrying for duty and politics. However, romantic love is a powerful emotion, and a magnificent topic for use in plays, poems, stories, and all manner of artistic endeavors. In this regard the concept of love has served the clan exceptionally well over the course of its history. That so many thousands throughout the Empire covet a beautiful Crane maiden or a dashing Crane swordsman as a spouse has only increased the clan&rsquo;s appreciation for Benten&lsquo;s power, and in thanks for such blessings they have constructed a large and elaborate temple to celebrate the Fortune. The temple, although elaborate for such religious structures, is still very modestly appointed compared to the majority of Crane holdings. It is staffed by a mixture of Asahina shugenja and Brotherhood monks from a sect of the Fortunist orders devoted to Benten.</p>"
    }
  },
  {
    "id" : "CN2",
    "name" : "Kakit Dueling Academy",
    "type" : "city",
    "pos" : [314.70587158203125, 229.80389404296875],
    "lblPos" : null,
    "provinceId" : "Imperial-3",
    "owner" : "crane",
    "details": {
      "html" : "<p>The Kakita artisans are for the most part regarded as the finest in the Empire, although there are some among the Empire&rsquo;s other art-inclined families who would doubtless contest the claim. Shiro sano Kakita is the home for all branches the Kakita Artisan Academy, although it is named for and dominated by the Kakita duelists who are its most famous graduates. Although the number of aspiring artisans among the Kakita and Doji families is greater than in any other clan, their number is still dwarfed by the students studying the methods of Crane dueling, universally regarded as the preeminent dueling style of the Empire. Though there are numerous places in the Crane lands where Kakita sensei teach their students, none are as large or well known as the institute which bears their name. The Kakita Academy exists for no other purpose save instruction. Its student body is dominated by young Crane, but there are always a fair number of students from other clans as well. It is not uncommon for other families and clans to call in considerable favors in order to permit their children the opportunity to study at this incredibly prestigious academy.</p>"
    }
  },
  {
    "id" : "CN3",
    "name" : "Kosaten Shiro",
    "type" : "castle",
    "pos" : [289.60784912109375, 254.9019317626953],
    "lblPos" : null,
    "provinceId" : "Imperial-3",
    "owner" : "crane",
    "details": {
      "html" : "<p>For the majority of its existence, Kosaten Shiro has been the vanguard of the Crane Clan&rsquo;s seemingly endless conflict with the neighboring Lion Clan. As with most military matters, this conflict was largely managed by the Daidoji family. Early in the Empire&rsquo;s history, it became obvious the conflict with the Lion was not one that was going to be quickly or quietly resolved. Rather than be forced to move large numbers of troops from Shiro Daidoji each time skirmishes broke out along the border, the Daidoji built Kosaten Shiro right at the line of conflict, ensuring the Daidoji would have a constant presence in the area and could respond quickly to outbreaks of violence. The castle is considered an important cornerstone to the Crane&rsquo;s defense of their western border, and the Daidoji hold it in high regard. However, they are an imminently practical family and consider even Kosaten Shiro to ultimately be a useful but potentially disposable military asset.</p>"
    }
  },
  {
    "id" : "CN4",
    "name" : "Kyuden Doji",
    "type" : "castle",
    "pos" : [325.686279296875, 288.62744140625],
    "lblPos" : null,
    "provinceId" : "Imperial-4",
    "owner" : "crane",
    "details": {
      "background" : "assets/images/details-bg-castle-crane.jpg",
      "html" : "<p>Kyuden Doji is the true center of the Crane Clan&rsquo;s power. From here the Doji govern the massive Crane provinces and coordinate the incredibly intricate political machine that empowers their clan. The first designs of this beautiful estate were put in place by Lady Doji herself, and the clan has gone to great lengths to preserve her vision, adding to it only after careful consideration of how such an act might impact the structure as a whole. The ten-story castle perches atop a high coastal plateau, surrounded by vast gardens and numerous supplemental structures. Indeed the Fantastic Gardens are almost as famous in the rest of Rokugan as the Doji palace itself.</p> <p>Unlike many familial estates, the Doji palace does not host any major dojo or military forces. It is reserved exclusively for matters of governance and politics. There are extensive and lavish guest quarters, allowing for more than a hundred guests and their entourages to attend at any one time. A visiting contingent of such size is not routine, of course, but the Doji have frequently hosted the Emperor&rsquo;s Winter Court.</p> <p>The training of Doji courtiers, the principle school the family maintains, is conducted in a small nearby city called Shizuka Toshi. The settlement was constructed specifically for that purpose in order to avoid any possibility of young courtiers embarrassing the clan before they are fully trained. Likewise, although politics and art are on display in great abundance throughout the Doji family palace, the family chooses to train its artisans at a branch of the Kakita Artisan Academy known as Seven Fold Palace.</p>"
    }
  },
  {
    "id" : "CN5",
    "name" : "Lonely Shore City",
    "type" : "city",
    "pos" : [263.7254943847656, 470.5882263183594],
    "lblPos" : null,
    "provinceId" : "Crane-1",
    "owner" : "crane",
    "details": {
      "html" : "<p>Mura Sabishii Toshi is a relatively out-of-the-way city, isolated by coastal hills and cliffs, and located well inside the borders of the Crane Clan&rsquo;s southern provinces. Few visitors to the Crane lands ever stumble upon it unless they are seeking it out specifically. This suits the Crane perfectly, since Lonely Shore City is a major center for their trade and commercial interests. Such things are not exactly proper for an honored guest to witness while traveling in one&rsquo;s lands. Of course, merchant patrons who are visiting for commercial reasons will seek out Lonely Shore City willingly enough.</p> <p>The Daidoji family is primarily responsible for overseeing the merchants who traffic in the Crane Clan&rsquo;s considerable material goods, and the legendary Daidoji Trading Council has its headquarters in Lonely Shore City. It is said Crane negotiations are never more ruthless and cutthroat than when conducted in this settlement, and it is certainly true that the Daidoji are not known for being as diplomatic or considerate as the other Crane families.</p> <p>This city is the center of almost all Crane relations with the Mantis Clan, since the Mantis are generally considered poor guests and in other locations are kept under careful supervision. Only within this city does the true nature of the Crane and Mantis relationship exist in its natural form, a commercial rivalry that varies wildly from season to season.</p>"
    }
  },
  {
    "id" : "CN6",
    "name" : "Seawatch Castle",
    "type" : "tower",
    "pos" : [291.9607849121094, 401.9607849121094],
    "lblPos" : null,
    "provinceId" : "Crane-3",
    "owner" : "crane",
    "details": {
      "html" : "<p>A minor village and keep in the southern Crane provinces, Seawatch Castle&rsquo;s original purpose is unknown, although many believe it was intended to survey the seas for potential pirate attacks early in the Empire&rsquo;s history. Certainly the small castle is perched on a high cliff where it affords a fine view of the sea. That purpose, if true, has long since fallen into disuse, and for much of its history the castle did little other than to serve as an out-of-the-way assignment for those Crane soldiers who managed to earn the ire of their commanding officers.</p> <p>At some point, however, a young and talented bushi was stationed at Seawatch Castle after being singled out by a jealous and ambitious superior officer. Far from being upset at his assignment, the young warrior enjoyed the serenity of the ocean, and often meditated on the cliff top. Over the years, this young warrior became a great duelist and eventually a sensei at the Kakita Dueling Academy, where his unique swordsmanship style was popular with the students. Although it never became the dominant style within the Kakita dojo, many still enjoy the fluid movement and natural rhythms of the Seawatch style, and in modern times Seawatch Castle has begun to enjoy more popularity with younger members of the clan.</p>"
    }
  },
  {
    "id" : "CN7",
    "name" : "Seven Fold Castle",
    "type" : "castle",
    "pos" : [331.1764831542969, 255.68624877929688],
    "lblPos" : null,
    "provinceId" : "Imperial-4",
    "owner" : "crane",
    "details": {
      "background" : "assets/images/details-bg-castle-crane-2.jpg",
      "html" : "<p>The Doji family&rsquo;s policy of placing its training facilities outside of the family&rsquo;s ancestral estate led inevitably to the creation of specialized locations where young Crane, especially Doji, can prepare for a life of service in the name of their clan. The principle training site for the legions of young Doji courtiers is the small city of Shizuka Toshi, a short distance from Kyuden Doji. Due to the sheer number of students that must be trained every generation, however, a second site was created over the centuries: Seven Fold Palace.</p> <p>In addition to its purpose as a courtier training facility, Seven Fold Palace also serves as a dojo for those members of the family who choose to study as artisans. The Kakita Artisan Academy maintains a subsidiary dojo within the palace for this purpose, and the students sent here are of the highest caliber. The Doji would never dishonor their Kakita cousins by sending sub-par students. For their part, the Kakita ensure the sensei at this school are just as superb as those at Shiro Sano Kakita itself.</p> <p>Unlike Shizuka Toshi, however, Seven Fold Palace can and does entertain guests. Since the students who are trained there are of the highest caliber, they are not generally considered risks for embarrassing the family with poor performance.</p>"
    }
  },
  {
    "id" : "CN8",
    "name" : "Shinden Asahina",
    "type" : "temple",
    "pos" : [237.05882263183594, 543.5294189453125],
    "lblPos" : null,
    "provinceId" : "Crane-7",
    "owner" : "crane",
    "details": {
      "html" : "<p>In a clan that defines the social norms of an Empire, the Asahina stick out badly. Descended from a union between Crane and Phoenix, the Asahina eschew violence at all costs and adhere to a strict, almost monastic creed that puts them at odds with the more conventional (and sometimes ostentatious) families of their extremely wealthy clan.</p> <p>The Asahina family estate is far more conservative in its appearance than other Crane ancestral estate, and as its name implies, much of it is actually a temple complex rather than a castle. This is not to say that Shinden Asahina is stark or austere. Rather, the Asahina simply prefer to appoint their home with less blatant displays of wealth. Everything within Shinden Asahina is of exceptional quality, and the artifacts, paintings, and sculptures are of superb quality. Indeed, this art is the only true extravagance found here, displays of exquisite craftsmanship &ndash; predominantly created by fellow Crane, but with plenty of outstanding examples from other clans as well. The Shiba artisans in particular have numerous works of art on display, and the close relationship between the Crane and Phoenix has made it possible for artistic exchanges to take place with regularity.</p> <p>The central temple of Shinden Asahina is quite ancient, dating back to the founding of the Asahina family, and its dark stone walls are carved with historical scenes and prayers for peace. It is said among the Crane that it can take a lifetime &ndash; or more &ndash; to read and truly comprehend all these carvings.</p>"
    }
  },
  {
    "id" : "CN9",
    "name" : "Shiro Daidoji",
    "type" : "castle",
    "pos" : [300.5882263183594, 273.7254638671875],
    "lblPos" : null,
    "provinceId" : "Imperial-4",
    "owner" : "crane",
    "details": {
      "html" : "<p>Those who do like the Daidoji family sometimes claim the only things they truly care about are the well-being of the Crane Clan and the preservation of their ancestral estate at Shiro Daidoji. Others dispute such a claim, stating the Daidoji care little even for their estate.</p> <p>In truth, the Daidoji regard their ancestral estate with a reverence most would reserve exclusively for holy sites or major temples. It is the most significant military fortress in the Crane lands, a distinction rivaled perhaps only by Kosaten Shiro. Shiro Daidoji is the only place most Daidoji ever truly feel at home within their own clan&rsquo;s lands. It is a stark and foreboding place, uniquely suited both to the militant family who calls it home and to its duty as the key to the northern Crane provinces&rsquo; defense.</p> <p>Shiro Daidoji has the least extensive guest accommodations of any Crane estate, and typically only officials from other Crane families pay visits to the place. It is rare indeed for out-of-clan visitors to stay at Shiro Daidoji longer than an overnight visit, and normally such visits are confined to those guests who can only be made more amenable to Crane diplomacy through appreciation of military strength. The castle does, however, boast a very extensive library of military writings, so extensive in fact as to rival the military records of the Lion Clan.</p>"
    }
  },
  {
    "id" : "CN10",
    "name" : "Tsuma",
    "type" : "city",
    "pos" : [304.9019470214844, 210.98036193847656],
    "lblPos" : null,
    "provinceId" : "Imperial-4",
    "owner" : "crane",
    "details": {
      "html" : "<p>Although it is often referred to as a village in official records, in truth Tsuma long ago became a bustling city and one of the great attractions of the Crane Clan provinces. The village was once home to a simple dojo of the Kakita Dueling Academy, a dojo that began a unique tradition for its students&rsquo; gempukku ceremony. The practice came to public notice when the Emperor and his court happened to attend one while traveling through the Crane lands. The Emperor enjoyed the event tremendously, and it soon became a topic of conversation throughout the Empire. In very short order, the tournament-style gempukku ceremony hosted at Tsuma became hugely popular and prestigious, and many clans and families solicited the Crane for the right for their young samurai to attend and compete.</p> <p>In the centuries since, Tsuma and its dojo have increased dramatically in size and the gempukku ceremony hosted in the city has become the most prestigious in all of Rokugan, with all clans sending their best and brightest to participate. Each winner of the tournament is declared the Topaz Champion, holding the title until the next year. Often the Champion is appointed a prestigious position in the Emerald Magistrates or another branch of the Imperial bureaucracy. Although the Emperor does not attend every spring, one or more of the Emperor&rsquo;s Chosen is almost always present.</p>"
    }
  },
  {
    "id" : "D1",
    "name" : "Furthest Fortress",
    "type" : "castle",
    "pos" : [159.80392456054688, 23.52941131591797],
    "lblPos" : null,
    "provinceId" : "Dragon-1",
    "owner" : "dragon",
    "details": {
      "background" : "assets/images/details-bg-castle-dragon.jpg",
      "html" : "<p>Built into the side of the great Tenkenniyoru Yama, the second largest mountain in Rokugan, Furthest Fortress was conceived and designed to be extremely difficult for anyone unfamiliar with its location to even see it, much less reach it. The very walls of the fortress blend in seamlessly with the rocks around them, so much so that the uneducated or unperceptive onlooker might easily assume the entire structure was nothing more than an oddly shaped rock outcropping and continue about their business (as if anyone could have legitimate business so high in the Great Wall of the North Mountains). Although ostensibly a Togashi holding, the fortress is staffed by members of all Dragon families in small numbers. Despite its relatively large size, its total contingent seldom numbers more than about three dozen or so at the most.</p> <p>The true purpose of the fortress is to house a large vault concealed deep within its innermost recesses. The vault doors are a puzzle (something the Dragon notoriously enjoy), an elaborate design that requires specific knowledge in order to enter. Some believe only the Dragon Champion knows how to open the vault known as the Final Riddle, while others believe no one at all knows how to open it. Its contents are unknown, and some in the clan claim it contains nothing at all.</p>"
    }
  },
  {
    "id" : "D2",
    "name" : "Great Fall Castle",
    "type" : "castle",
    "pos" : [190.39215087890625, 77.2549057006836],
    "lblPos" : null,
    "provinceId" : "Dragon-1",
    "owner" : "dragon",
    "details": {
      "background" : "assets/images/details-bg-castle-dragon-2.jpg",
      "html" : "<p>A joint holding of the Mirumoto and the Kitsuki families, Great Fall Castle is perhaps the greatest dojo of the Dragon Clan outside of the ancient and legendary Iron Mountain Dojo itself. Within its walls the bushi of the Mirumoto train side-by-side with the Kitsuki investigators. The unique martial sect of the investigators known as the Justicars, who rely on martial skill to prove the guilt of criminals, are also trained here, benefiting from the techniques of both the Kitsuki and the Mirumoto.</p> <p>In addition to its value as a major dojo for the clan, Great Fall Castle is a repository of weapons and other resources, carefully stockpiled in case an invasion, siege, or other calamity strikes the clan. Stockpiling weapons might seem out of character for the Dragon, but for all their poetic and enigmatic reputation the Mirumoto are ultimately an eminently practical people, and they consider this simply a sensible precaution to ensure future security.</p>"
    }
  },
  {
    "id" : "D3",
    "name" : "High House of Light",
    "type" : "temple",
    "pos" : [170, 49.80392074584961],
    "lblPos" : null,
    "provinceId" : "Dragon-1",
    "owner" : "dragon",
    "details": {
      "html" : "<p>The mysterious monastery that is home to the Togashi tattooed order has been known by many different names throughout its history, including Kyuden Togashi and Kyuden Hitomi, but is most often known simply as the High House of Light. Situated high in the western mountains of the Dragon provinces, the High House is visible for miles around to all who care to look for it&hellip; but there is no visible path leading up the mountain to the monastery&lsquo; s mighty gates. The few outsiders who have visited the place sometimes question how the great mountaintop complex could have been constructed in the first place, but the Togashi do not care to address the issue. Physically, witnesses describe the High House as a mixture of temples and castle seems to.</p> <p>Supposedly, the purpose of the monastery&rsquo;s difficult location is that the climb to reach it represents the change that comes over those who seek out the Togashi in hopes of joining their ranks. It is certainly true that while the majority of the tattooed order are former Dragon, all Great Clans and most Minor Clans have former members among their ranks as well.</p> <p>As one might expect, the quarters available for guests at the High House are extremely limited, and no Great Clan has sent a formal delegation there in many decades, having learned long ago that such endeavors are pointless. The limited quarters available are primarily for visiting members of the other Dragon families, but all tattooed monks are free to invite guests as they see fit, and some take advantage of this right from time to time. Aside from austere living chambers, the High House is primarily a temple complex, with a main level boasting shrines to every major Fortune and Kami while the lower levels &ndash; carved out of the living rock of the mountaintop &ndash; contains countless smaller shrines to every minor Fortune known to the Empire.</p>"
    }
  },
  {
    "id" : "D4",
    "name" : "Norther Tower of Flame",
    "type" : "tower",
    "pos" : [204.90196228027344, 31.764705657958984],
    "lblPos" : null,
    "provinceId" : "Dragon-2",
    "owner" : "dragon",
    "details": {
      "html" : "<p>The Northern Towers of Flame, also sometimes called the Northern Watchtowers, are a series of five large towers built along the relatively flat land in the northernmost Dragon provinces, where they meet the higher slopes and deep recesses of the Great Wall of the North Mountains. The towers are placed on the very edge of vision from one another, so signals can conceivably be sent between them across the open miles of the northern Dragon border. They were constructed to aid in defending the clan against aggression from gaijin enemies to the north, primarily the Yobanjin raiders who live in the northern steppes beyond the mountains. Realistically, the towers are too distant from one another to do more than serve as an early warning system.</p> <p>The Mirumoto have sometimes broached the topic of adding additional towers to the line, but the rugged geography of the mountains prevents that from being a realistic possibility. Over the years, the Dragon have at least added more barracks and storage chambers at the base of each tower to ensure that additional troops can be stationed there should it become necessary.</p>"
    }
  },
  {
    "id" : "D5",
    "name" : "Pillars of Virtue",
    "type" : "shrine",
    "pos" : [135.4901885986328, 31.372549057006836],
    "lblPos" : null,
    "provinceId" : "Northlands-3",
    "owner" : "dragon",
    "details": {
      "html" : "<p>The Pillars of Virtue is a sacred site associated with the Togashi order. Few outside of the order are aware of its existence, and even fewer have ever visited it. For a Togashi to bring an outsider to the Pillars is considered an act of the greatest respect, and indicates the monk believes the individual in question is of such strong caliber and understanding that they may be ready to embrace the simple but life-altering precepts represented by the Pillars.</p> <p>The Pillars are a place for the Togashi to reflect upon the most basic lessons of their order, a place far removed even from the concerns of the rest of the Dragon Clan. Their location is high in the Dragon mountains, far from all other settlements, even the High House of Light. A simple torii arch stands before three enormous stone spires, each hollowed out for use by the order and each topped with a statue representing one of Togashi&rsquo;s first followers, founding members of the tattooed order. Although their names have been long forgotten, each of these three monks represents one basic aspect of the Togashi philosophy: wisdom, morality, and discipline.</p>"
    }
  },
  {
    "id" : "D6",
    "name" : "Morning Frost Castle",
    "type" : "castle",
    "pos" : [167.64706420898438, 92.54901885986328],
    "lblPos" : null,
    "provinceId" : "Dragon-1",
    "owner" : "dragon",
    "details": {
      "html" : "<p>The remote keep known as Morning Frost Castle is one among many locations within the Dragon lands that could likely exist nowhere else, simply because the philosophy behind it is so strange (and occasionally unnerving) to other clans. Morning Frost Castle&rsquo;s principle purpose is as a dojo, but one unlike any other in the Dragon lands, possibly in the Empire, for its purpose is simply to teach samurai how to teach. It is, in effect, a dojo for sensei. Among the other clans, this sort of approach would make little sense. The conventional wisdom, after all, is that a great warrior becomes a sensei by choosing to teach his methods to another, and students must prove worthy to learn in a manner befitting their teacher.</p> <p>The Dragon have not truly abandoned the traditional view of the relationship between sensei and student, but they do understand it is in the best interests of the clan for its greatest warriors to pass on as much as they are able to their students.</p> <p>In order to facilitate this, those who are chosen to succeed other sensei at major dojo in the Dragon lands are taken to Morning Frost Castle for a period of up to six months in order to prepare them for their impending duties as teachers. By the reckoning of even the most traditionalist Dragon samurai, a soldier would not be sent to war without proper training, so why should those responsible for training the next generation of warriors be left unprepared?</p>"
    }
  },
  {
    "id" : "D7",
    "name" : "Shiro Kitsuki",
    "type" : "castle",
    "pos" : [192.35293579101562, 96.86274719238281],
    "lblPos" : null,
    "provinceId" : "Dragon-5",
    "owner" : "dragon",
    "details": {
      "html" : "<h3>Last Step Castle</h3><p>Last Step Castle is both the ancestral estate of the Kitsuki family and the diplomatic center for the Dragon Clan. It is the first major holding along the principle road that guides travelers into the Dragon mountains, and the only one easily reachable by conventional means. Legend holds that even the road to Shiro Kitsuki is difficult to find for anyone not welcome in Dragon lands, and whether this is true or not, the routes from the castle onward into the Dragon mountains is by all accounts extremely difficult to traverse for all but the most experienced travelers and mountaineers.</p> <p>Shiro Kitsuki is a trio of high castles, connected to each other by an encircling fortified wall. Dozens of windows line those walls, looking down on approaching visitors like curious eyes. Because of both its relative accessibility (a point many visitors would vigorously contest) and the notoriously keen perceptions of the Kitsuki, the estate was long ago chosen to become the clan&rsquo;s primary hosting site for guests, particularly during the winter. The large castle has more than double the number of guest accommodations available from the next closest contender, and the court chambers are very slightly more lavish &ndash; and noticeably more traditional &ndash; than those of more individualistic family estates. There is a small set of suites set aside specifically for visitors from the Dragonfly lands to the south, so they can coordinate more readily with their allies among the Dragon (for whom they act as a sort of buffer against unwanted guests).</p> <p>In addition to its primary purpose as a diplomatic center, Shiro Kitsuki is also a great center of learning, with vast libraries, multiple dojo for the training of young Kitsuki, and a large temple created and operated in conjunction with the Tamori to further the knowledge of both families.</p>"
    }
  },
  {
    "id" : "D8",
    "name" : "Shiro Mirumoto",
    "type" : "castle",
    "pos" : [211.56861877441406, 99.21568298339844],
    "lblPos" : null,
    "provinceId" : "Dragon-4",
    "owner" : "dragon",
    "details": {
      "html" : "<p>Although not traditionally the home of the Dragon Clan Champion, Shiro Mirumoto is very much the place from which the clan has been governed over most of its history. The Togashi Champions have usually delegated much of their authority, and with it responsibility, to the Mirumoto lords, and as such it has become second nature for most functions of clan government &ndash; such as succession debates, inter-clan relations, and the collection of taxes &ndash; to center around Shiro Mirumoto.</p> <p>Accordingly, Shiro Mirumoto is a sort of jack-of-all-trades when it comes to the purposes normally fulfilled by a familial estate. It is, first and foremost, a military fortress, its intended purpose at the time of its construction. In fact, it is the largest and most heavily defended fortress in all the Dragon lands. It is also one of the largest centers of learning, for just nearby is Iron Mountain Dojo, the greatest of all Mirumoto teaching institutions.</p> <p>Although the Kitsuki traditionally maintain the majority of the clan&rsquo;s guests at Last Step Castle, the Mirumoto are known to host smaller numbers of guests each season as well. Traditionally, the military nature of Shiro Mirumoto means that only rigidly military individuals are invited to stay; most courtiers and artisans find the place far too stern to enjoy a season there, and the Dragon would certainly not wish to offend their guests.</p>"
    }
  },
  {
    "id" : "D9",
    "name" : "Shiro Tamori",
    "type" : "castle",
    "pos" : [198.23529052734375, 61.17647171020508],
    "lblPos" : null,
    "provinceId" : "Dragon-1",
    "owner" : "dragon",
    "details": {
      "html" : "<p>Previously known as Kyuden Agasha, Shiro Tamori was significantly changed when the remnants of the Agasha who did not defect to the Phoenix Clan were reformed as the Tamori family. The castle now better reflects the Tamori&rsquo;s martial inclinations and their unquestionable disinterest in entertaining guests. This is a rather equitable arrangement, for the few individuals who have been guests at the castle find it almost entirely inhospitable, not to mention disconcerting. In addition to the militant and generally cold nature of most Tamori samurai, the strange alchemical experiments that are constantly ongoing within the castle&rsquo;s large foundries generate a constant sense of unease. Strange smells fill the air at all hours, and those who visit feel a constant lingering suspicion that the castle could explode at any moment. These are not entirely unfounded suspicions either; the castle is built into the side of a largely but not entirely dormant volcano known as Fire Tooth Mountain. The castle itself is surrounded by frowning battlements and defensive towers, looking more like a Crab fortress than the home of a shugenja family. Despite its remote location it is a nearly self-sufficient castle. The peasants who work the modest fields below its walls, the artisans who make its clothing and tools, the eta who deal with its waste and corpses&hellip; all dwell within its walls.</p> <p>In earlier centuries, when this castle was still called Kyuden Agasha, relations with the Phoenix were cordial, and visitors from that clan sometimes paid visits to this settlement despite its remote and forbidding nature. In modern times, the lingering resentment of many Tamori over the Agasha family&rsquo;s defection to the Phoenix prevents any significant cooperation.</p>"
    }
  },
  {
    "id" : "D10",
    "name" : "Tetsu Kama Mura",
    "type" : "village",
    "pos" : [221.76470947265625, 60.39215850830078],
    "lblPos" : null,
    "provinceId" : "Dragon-2",
    "owner" : "dragon",
    "details": {
      "html" : "<h3>Iron Mountain Village</h3> <p>Iron Mountain Village is the home of the single most productive iron mine in all of the Dragon provinces, an impressive claim indeed when one considers how mineral-rich the northern mountains are. The Mirumoto provinces in particular can boast a great many iron mines, but none can rival the sheer volume of output from those maintained at Tetsu Kama Mura.</p>"
    }
  },
  {
    "id" : "L1",
    "name" : "Bishamon Seido",
    "type" : "temple",
    "pos" : [269.6078186035156, 227.05882263183594],
    "lblPos" : null,
    "provinceId" : "Lion-6",
    "owner" : "lion",
    "details": {
      "html" : "<p>This massive temple to Bishamon, Fortune of Strength, is the largest shrine to the great Fortune found anywhere in the Emerald Empire. Even the mighty warriors of the Crab Clan, many of whom revere Bishamon above all other Fortunes, have not constructed any shrine even half its size. Some find it strange that the normally stoic and traditional Kitsu would maintain such a shrine, but the Kitsu consider war a holy pursuit, and there is never any shortage of shugenja to staff the temple and learn the art of using the kami on the battlefield. In addition to its dual roles as a temple and a dojo, the shrine is also a major storehouse for food and additional goods, usually excess supplies and materials that cannot be stored in the nearby city of Tonfajutsen.</p>"
    }
  },
  {
    "id" : "L2",
    "name" : "Castle of the Swift Sword",
    "type" : "castle",
    "pos" : [209.079833984375, 170.37017822265625],
    "lblPos" : null,
    "provinceId" : "Lion-4",
    "owner" : "lion",
    "details": {
      "html" : "<p>Although it is not the ancestral estate of the Akodo family (an honor which belongs to the more simply titled Shiro Akodo), the Castle of the Swift Sword is home to the largest of the Akodo family&rsquo;s dojo. Also known as Shiro sano Ken Hayai, the Castle of the Swift Sword is one of the cornerstones in the clan&rsquo;s northern and western defenses, borders shared with the Dragon and Unicorn, respectively.</p> <p>While Shiro Akodo is the seat of the Akodo family&rsquo;s power, the Castle of the Swift Sword is in many ways their heart and soul. Hundreds of young samurai are trained within its walls each year, bolstering the ranks of the Lion armies. The sensei who teach here are widely renowned as the finest in the Lion lands, respected by other sensei in both the Lion Clan and among other clans of the Empire as well.</p>"
    }
  },
  {
    "id" : "L3",
    "name" : "Crossroads Castle and Tonfajutsen",
    "type" : "castle",
    "pos" : [251.4327850341797, 203.31134033203125],
    "lblPos" : null,
    "provinceId" : "Lion-5",
    "owner" : "lion",
    "details": {
      "html" : "<h3>Central Castle</h3> <p>Also known as Central Castle, Crossroads Castle is located in the city of Tonfajutsen, which is in turn situated directly in the middle of the Lion provinces. The simple, unadorned castle is the centerpiece of the city, itself a practical place entirely focused on properly gathering, sorting, and distributing the incredible volume of supplies necessary to ensure the Lion Clan&rsquo;s massive military operation continues to function properly. Virtually every ounce of rice, barley, or any other foodstuff available to the Lion, whether it be grown in their own provinces or imported from other clans, is collected within this city&rsquo;s seemingly endless storehouses. An entire legion of quartermasters and officers is permanently stationed at the castle, poring endlessly over every report. They review everything from the most recent census to the constantly changing accounts of the clan&rsquo;s troop placement and movement, assigning the vast resources within the city accordingly.</p>"
    }
  },
  {
    "id" : "L4",
    "name" : "Great Hall of Records",
    "type" : "tower",
    "pos" : [233.7857208251953, 192.33096313476562],
    "lblPos" : null,
    "provinceId" : "Lion-5",
    "owner" : "lion",
    "details": {
      "html" : "<p>The Ikoma family has a strong tradition of duty and reverence. Their line includes some of the greatest historians of each generation. There are entire branches of the family whose duties for the clan are nothing more than the painstaking maintenance and extension of the Lion Clan&rsquo;s vast historical records. Unfortunately, during the Empire&rsquo;s history there have been a number of tragedies, both accidental and intentional, that have damaged historical records like those maintained by the Ikoma. The family learned long ago to make multiple copies of every document and secret them in various locations, ensuring no purge has ever been wholly successful.</p> <p>Portions of the Ikoma histories are kept in a variety of secure locations, some of them unavailable to outsiders. In the late twelfth century, Kyuden Ikoma itself was sacked in an assault by an invading Unicorn force, and after that incident the Ikoma created a new fortress to protect a complete copy of their entire histories, above and beyond what is kept elsewhere. This new, modern fortress does not have the weight of history behind it, but it does enjoy all the most recent advances in military construction and defense, making it nigh unassailable by all but the most dedicated enemies.</p>"
    }
  },
  {
    "id" : "L5",
    "name" : "Hall of Ancestors",
    "type" : "temple",
    "pos" : [208.68768310546875, 213.50743103027344],
    "lblPos" : null,
    "provinceId" : "Scorpion-1",
    "owner" : "lion",
    "details": {
      "html" : "<p>Given the absolute reverence all members of the Lion Clan have for their ancestors, the Hall of Ancestors is easily the most sacred site within the whole of Lion lands. Here in this vast temple, the ashes of the clan&rsquo;s great heroes and veterans are interred, accompanied by funeral rites by some of the finest priests in the Kitsu family. The intermingling of bloodlines over the centuries ensures not only that all Lion samurai have some relation, no matter how distant, interred within the Hall, but that they are keenly aware of exactly who these ancestors are and how they died. Although it is not mandated, an informal tradition among the clan expects all Lion samurai to travel to the Hall at least once during their lifetime (barring a sudden and violent end to said lifetime). The vast majority in fact undertake this pilgrimage many times throughout their lives.</p> <p>It should go without saying that the Lion defend the Hall of Ancestors fiercely from any and all threats. Traditionally, the second child born of the Matsu family daimyo is appointed as Defender of the Hall, the person responsible for coordinating its defense from outsiders. Although this is a military position, there is a strong spiritual aspect to the office as well. Members of the Brotherhood of Shinsei attend the temple to assist in its upkeep as well as to serve as advisors to the Defender and his men.</p>"
    }
  },
  {
    "id" : "L6",
    "name" : "Kitsu Tombs",
    "type" : "temple",
    "pos" : [238.88375854492188, 219.38978576660156],
    "lblPos" : null,
    "provinceId" : "lion-6",
    "owner" : "lion",
    "details": {
      "html" : "<p>This remote temple is the private burial place of the Kitsu family. Traditionally only Kitsu remains are interred here, although they do very occasionally offer highly honored personages from the other families the tremendous privilege of sharing the Tombs. The reasons for the Kitsu preferring their own sacred site for interment over the Hall of Ancestors lies in the inhuman ancestry of the first Kitsu. It is rumored there are unusual rites and prayers the Kitsu use to usher their dead into the next world. Certainly it is a documented fact that the Kitsu have private rituals that allow the most powerful of their number to cross into the spirit realms and walk among the dead. The precise nature of these private rituals is guarded from the other Great Clans, necessitating absolute secrecy &ndash; a further reason for the Kitsu Tombs. Even other Lion families, while welcome to visit, are not free to wander the grounds on their own, and are escorted at all times during their stay.</p>"
    }
  },
  {
    "id" : "L7",
    "name" : "Kyuden Ikoma",
    "type" : "castle",
    "pos" : [212.2170867919922, 186.84075927734375],
    "lblPos" : null,
    "provinceId" : "lion-4",
    "owner" : "lion",
    "details": {
      "html" : "<h3>Sacred Watch Palace</h3> <p>Sacred Watch Palace is the ancestral estate of the Ikoma family, a family both diverse and conflicted in their history and philosophy. The first Ikoma was a consummate warrior and a canny negotiator, traditions that his descendants have embraced along with his penchant for stories and tales, the latter leading to their reverence for history. What is not as commonly discussed are accounts of Ikoma as a hard-drinking and rough-spoken man and a ruthless opponent who would exploit any advantage against his enemies. Modern Ikoma samurai for the most part do not discuss this aspect of their founder, and take issue with any who do, but there are still a few among their number who exemplify these tales with their own boisterous lifestyles.</p> <p>Kyuden Ikoma, like all Lion fortresses, is a simple and spartan castle designed with practical military defense in mind. The lands surrounding it are particularly fertile, and are generally known as the Venerable Plains. They are considered sacred and the Ikoma go out of their way to defend their core lands against interlopers.</p>"
    }
  },
  {
    "id" : "L8",
    "name" : "Ninkatoshi",
    "type" : "city",
    "pos" : [282.8053283691406, 180.17408752441406],
    "lblPos" : null,
    "provinceId" : "lion-5",
    "owner" : "lion",
    "details": {
      "html" : "<h3>Permission City</h3><p>Also known as Ninkatoshi, this city is one of the clan&rsquo;s easternmost holdings, a major fortification along the often-contested border the Lion share with their traditional enemies, the Crane. Ninkatoshi began centuries ago as a farming village, one of countless minor settlements in the area that took advantage of the fertile central plains of the Lion provinces. Because of the long-standing animosity between the Lion and Crane, however, the village rapidly became a center for border enforcement, and from there grew into a base for military mobilization against the clan&rsquo;s enemies. Over the centuries there have been a tremendous number of skirmishes and major engagements near the city. It is a testament to the industriousness of the city&rsquo;s peasants that the lands around it remain fertile and productive despite the frequent passage of large armies. Due to the city&rsquo;s legacy as a center of war, an assignment to Ninkatoshi is looked upon by Lion samurai as a great honor even during periods of peace between the Lion and Crane.</p>"
    }
  },
  {
    "id" : "L9",
    "name" : "Shiro Akodo",
    "type" : "castle",
    "pos" : [287.2549133300781, 223.52938842773438],
    "lblPos" : null,
    "provinceId" : "lion-6",
    "owner" : "lion",
    "details": {
      "background" : "assets/images/details-bg-castle-lion.jpg",
      "html" : "<p>The ancestral estate of the Akodo family could quite easily be mistaken for a much more mundane building, were it not for its large size. Indeed, even with its formidable bulk the castle is sometimes mistaken for a fortification of lesser importance. Shiro Akodo is largely free from any adornment or decoration, other than the most basic elements inherent to castle design. It is a perfect example of the Akodo family&rsquo;s general disinterest in matters of art or politics, in which they engage only as necessary. In fact, because the castle is so simple in its construction and appointment, the Akodo rarely if ever host guests, preferring to allow such duties to fall to the Ikoma.</p> <p>The Akodo philosophy places tremendous emphasis on their duty as officers and tacticians and on the vital and honorable tradition of teaching. In fact, the Akodo are reluctant to combine such matters with the mundane duties of governance, lest the work of administration interfere with the study of war or the instruction of a new generation. For this reason, while Shiro Akodo is every bit the military installation one might expect from a Lion familial estate, its primary function is the governance of the Lion Clan. The family has moved most of its teaching and military training to the Castle of the Swift Sword elsewhere in the Lion lands.</p>"
    }
  },
  {
    "id" : "L10",
    "name" : "Shiro Matsu",
    "type" : "castle",
    "pos" : [222.80532836914062, 210.37017822265625],
    "lblPos" : null,
    "provinceId" : "lion-6",
    "owner" : "lion",
    "details": {
      "html" : "<p>If the ancestral estate of the Akodo family is simple, the only word that can be used to describe the Matsu family&rsquo;s ancestral home is &lsquo;stark.&rsquo; The Matsu care nothing whatsoever for politics, diplomacy, or (to hear some say it) even basic common courtesy. They are warriors, one and all, and the family&rsquo;s general philosophy is that if war is their destiny it should be embraced eagerly. Most in the Empire would consider a position as guest at Shiro Matsu to be a terrible punishment. The Matsu are not gracious hosts and their home has nothing at all that could be considered luxury. Guests can expect only the most basic accommodations, and can also expect to be awakened well before each dawn by the cacophonous noise of hundreds or even thousands of young samurai training in the vast courtyards and drill fields surrounding the castle.</p>"
    }
  },
  {
    "id" : "M1",
    "name" : "Broken Wave City",
    "type" : "castle",
    "pos" : [367.2548828125, 110.64706420898438],
    "lblPos" : null,
    "provinceId" : "Phoenix-6",
    "owner" : "mantis",
    "details": {
      "html" : "<p>Broken Wave City dominates the entirety of the small island known as Kaigen&rsquo;s Island, which was formed by the heroic sacrifice of two shugenja during the final moments of a costly war between the Mantis and Phoenix. The city covers most of the island, which in turn sits just off the Phoenix coastline. Broken Wave City and its capital, the fortress of Kyuden Kumiko, serve as the center of Mantis trade with the mainland throughout the northern Empire, and on rare occasions serve as a point of departure for ships leaving north toward the Yobanjin lands outside the Empire. Broken Wave City has an extensive series of docks, known as Seven Seas Port, that allow the relatively small island to serve as the headquarters for the First Storm, one of three large fleets of vessels the Mantis Clan maintains for naval combat and commerce. Despite its success for the clan, Broken Wave City continues to serve as a point of contention with the Phoenix Clan, who regard the island (which they call Sachi&rsquo;s Anvil) as a portion of their territory ceded to the Mantis in a hasty and ill-advised treaty.</p>"
    }
  },
  {
    "id" : "M2",
    "name" : "City of Lightning",
    "type" : "city",
    "pos" : [321.1960754394531, 503.5294189453125],
    "lblPos" : null,
    "provinceId" : "Mantis-4",
    "owner" : "mantis",
    "details": {
      "html" : "<p>Toshi no Inazuma is a prominent and important Yoritomo holding, very nearly on par with Kyuden Gotei in most regards. It began primarily as a religious holding, and contains one of the Empire&rsquo;s largest shrines to Osano-Wo, the Fortune of Fire and Thunder. The temple is the tallest building in this sprawling city. In the past, the temple was struck by lightning at least once a year, causing frequent fires that damaged the city. Eventually, the shugenja maintaining the temple discovered that attaching a metal rod to the temple&rsquo;s peak would allow the fury of the Thunderer to be mitigated without repeatedly burning entire portions of the building &ndash; and city &ndash; to the ground.</p>"
    }
  },
  {
    "id" : "M3",
    "name" : "Dragon's Guard City",
    "type" : "city",
    "pos" : [339.2759094238281, 167.23291015625],
    "lblPos" : null,
    "provinceId" : "Imperial-1",
    "owner" : "mantis",
    "details": {
      "html" : "<p>This port city existed for centuries as an independent settlement north of the old Imperial capital, Otosan Uchi. Due to its proximity to that great metropolis, the city remained safe and prosperous for centuries, feeding off the trade that ran from the capital north to the Phoenix and Dragon clans. Even after Otosan Uchi fell into ruins, Dragon&rsquo;s Guard City&rsquo;s strategic location allowed it to remain a successful settlement. However, during the chaos of the second half of the twelfth century, the city became a target for the more opportunistic Great Clans, who were attempting to garner as many resources as possible to make a bid for a vacant throne. The leaders of Dragon&rsquo;s Guard City, through the assistance of their allies in the Tortoise Clan, solicited the protection of the Mantis in exchange for a mutually beneficial arrangement of trade and defense. The Mantis accepted, and under the clan&rsquo;s rule the city has become even more prosperous than before.</p>"
    }
  },
  {
    "id" : "M4",
    "name" : "Iron Turtle City",
    "type" : "city",
    "pos" : [375.313720703125, 433.3333435058594],
    "lblPos" : null,
    "provinceId" : "Mantis-3",
    "owner" : "mantis",
    "details": {
      "html" : "<p>Koutetsukan is a largely unremarkable city, with very few landmarks of any significance and little to keep in the memory of its few visitors. In fact, the only landmark to speak of in the city is the massive array of shipyards that dominate virtually every inch of its coastline. More ships are probably produced in Koutetsukan than in every other shipyard in the Empire combined &ndash; although there are certain ports in the southern Crab provinces that might challenge such a claim. The shipyards at Koutetsukan are responsible for the vast majority of ship production for the Mantis, although there are a small number of other much less grandiose shipyards serving the clan. They also produce ships for the Crab, Phoenix, and Crane, which the Mantis sell to the intended clan for a very handsome profit.</p>"
    }
  },
  {
    "id" : "M5",
    "name" : "Kyuden Ashinagabachi",
    "type" : "castle",
    "pos" : [235.09803771972656, 264.70587158203125],
    "lblPos" : null,
    "provinceId" : "Scorpion-3",
    "owner" : "mantis",
    "details": {
      "html" : "<p>Kyuden Ashinagabachi has a sordid history that is a point of contention with not one, but two other Great Clans. It was once a Scorpion holding, but the lord of the castle abandoned his duty to marry his lover, a Lion, who also abandoned her arranged marriage for this improper union. Needless to say, the Lion and Scorpion did not look kindly upon this and attempted to destroy the castle and all its occupants. Although the two lovers perished, their son led his men to victory and recaptured the castle. Afterward the Emerald Champion was granted the charter of a Minor Clan, the Wasp Clan. Since then the castle has built a reputation as housing the greatest archery school in the Empire, and the Tsuruchi warriors who maintain the estate are widely feared as terrible opponents capable of killing from vast distances.</p>  <p>Nestled high in the mountain peaks, Kyuden Ashinagabachi is extremely difficult to approach with any sizeable force. Those who are foolish enough to attack must make their way through miles of narrow, difficult canyons, while hundreds of Tsuruchi marksmen able to pick them off from above at their leisure.</p>"
    }
  },
  {
    "id" : "M6",
    "name" : "Kyuden Gotei",
    "type" : "castle",
    "pos" : [340.7745056152344, 469.4117736816406],
    "lblPos" : null,
    "provinceId" : "Mantis-3",
    "owner" : "mantis",
    "details": {
      "background" : "assets/images/details-bg-castle-mantis.jpg",
      "html" : "<p>The center of the Yoritomo family&rsquo;s power, Kyuden Gotei is not only the largest and most magnificent palace in the Mantis Clan, but also the center of one of the largest cities in the entire Empire, rivaling Ryoko Owari Toshi and the Imperial capital. It is also, by general consensus of those who have visited it, perhaps the most ostentatious family estate in Rokugan. The Yoritomo have different views than most samurai regarding wealth and material possessions, and tend to decorate their estate with elaborate and gaudy treasures, many of a gaijin nature. Very close at hand to the palace is Heaven&rsquo;s Bank Hold, the vault in which the clan stores most of its substantial wealth, and its proximity may contribute to the elaborate d&eacute;cor of Kyuden Gotei.</p>   <p>During the long centuries when the Mantis Clan was a Minor Clan, this palace served as the diplomatic center for their relations with other Minor Clans, and it was within its halls that the beginning of the alliance between the Mantis, the Centipede, and the Wasp was born. Since the ascension to Great Clan status, the Mantis islands have seen a dramatic increase in the number of visitors, and Kyuden Gotei has become a major center for diplomacy. The Mantis host their guests in all the splendor their wealth will allow, reveling in the fact that the other Great Clans now have ample reason to maintain diplomatic ties.</p>"
    }
  },
  {
    "id" : "M7",
    "name" : "Kyuden Kitsune",
    "type" : "castle",
    "pos" : [219.49020385742188, 458.8235168457031],
    "lblPos" : null,
    "provinceId" : "Crane-5",
    "owner" : "mantis",
    "details": {
      "html" : "<p>For almost the entirety of its existence, Kyuden Kitsune was the Fox Clan palace, the center of civilization for the small, rural Fox Clan. The Fox were always a poor clan, even by Minor Clan standards, and their recent annexation by the Mantis has seen an influx of resources the likes of which the Kitsune family has never experienced at any point in its history. As such, Kyuden Kitsune, already a diplomatic center for Minor Clan activity and the favored haunt of certain influential Great Clan ambassadors, has begun to improve its size, d&eacute;cor, and accommodations. This has already resulted in a slight increase in the number of visitors each year, particularly because the Yoritomo hope to capitalize on the strong positive opinion of the Kitsune family throughout Imperial political circles.</p>  <p>In addition to its practical value, Kyuden Kitsune is becoming a popular destination for young courtiers during the winter because of its proximity to the mysterious and beautiful Kitsune Mori, one of the most breathtaking forests in the Empire. It has developed a reputation as an inspiring sight for young lovers, especially when its trees are covered in snow during the winter months.</p>"
    }
  },
  {
    "id" : "M8",
    "name" : "Shaiga",
    "type" : "village",
    "pos" : [245.686279296875, 326.2745056152344],
    "lblPos" : null,
    "provinceId" : "Scorpion-5",
    "owner" : "mantis",
    "details": {
      "html" : "<p>This small and seemingly unassuming village is of enormous importance to the Tsuruchi family, since it accounts for the vast majority of their mainland food production. It is located some distance from Kyuden Ashinagabachi, on a stretch of plains that sits between the Scorpion and Crane lands. The lands are surprisingly fertile, owing perhaps to the fact that a lake once existed here but dried up long ago. The Tsuruchi maintain virtually no military presence within the village, hoping its seeming unimportance will keep other clans away while its status as a Tsuruchi holding will deter bandits. Still, the Tsuruchi do secretly train the village peasants in the use of weapons such as the tonfa and nunchaku so it can be defended if necessary.</p><p>Shaiga&rsquo;s value is greater still than its agricultural production. There is a very small gold mine nearby that is kept absolutely secret at all costs. The Tsuruchi use their contacts within the Emerald Magistrates to pay taxes on the mine&rsquo;s yield while keeping its existence concealed from all outside the clan.</p>"
    }
  },
  {
    "id" : "M9",
    "name" : "Thunder Dragon Bay",
    "type" : "generic",
    "pos" : [364.9019470214844, 540],
    "lblPos" : null,
    "provinceId" : "Mantis-5",
    "owner" : "mantis",
    "details": {
      "html" : "<p>This serene and reclusive bay is on the eastern edge of the Mantis islands, just before the Islands of Silk &amp; Spice give way to vast open seas that stretch as far as any man has ever seen. This bay is well protected by a natural barrier of jagged coral reefs that lie just beneath the surface of the water, along with occasional rocky outcroppings large enough in size to technically be called islands by the most generous of observers. When the celestial entity known as the Thunder Dragon manifests in the mortal realm, it often appears here &ndash; the dragon favors this location for unknown reasons. During its more extended stays, the Mantis Clan provides fleet resources to ostensibly protect the dragon. Of course, this is almost a ridiculous gesture, since there is nothing that could threaten the creature that the Mantis would be capable of destroying. The Yoritomo, however, see it as sort of an honor guard, and insist upon providing this service for their celestial patron regardless of its questionable value.</p>"
    }
  },
  {
    "id" : "M10",
    "name" : "Tokigogachu",
    "type" : "village",
    "pos" : [359.4117736816406, 524.7058715820312],
    "lblPos" : null,
    "provinceId" : "Mantis-5",
    "owner" : "mantis",
    "details": {
      "html" : "<p>This tiny fishing village in the eastern islands is unremarkable in every regard save for one exceptional quality. In almost all ways it is quite average, with hard working peasants and perhaps a slightly above average yield of fish. The unique nature of Tokigogachu is the special zeal of its citizens for festivals of all kinds. Because the village has ample fish harvests to pay its taxes, and has a small amount of arable land to grow rice and barley and more tropical fruits, there is never a shortage of funds or food. Rather than purchase extravagant treasures and decorations as so many villages in the island are prone to doing, the people of Tokigogachu prefer to host lavish celebrations of the various religious and cultural festivals observed by the Empire. Decorations and fireworks are always in ample supply, as is excellent food and music. The villagers welcome any and all visitors, peasant and samurai alike. Rumor holds that even Emperors have attended the festivals in the past, although always disguised in order to avoid embarrassing or troubling the village. After all, no Emperor would openly visit such an obscure and mediocre village.</p>"
    }
  },
  {
    "id" : "M11",
    "name" : "Valley of the Centipede",
    "type" : "generic",
    "pos" : [310.39215087890625, 296.86273193359375],
    "lblPos" : null,
    "provinceId" : "Crane-1",
    "owner" : "mantis",
    "details": {
      "html" : "<p>Tani Senshio is a remote valley in the Spine of the World Mountains, arable but with little enough value that the neighboring Crane never claimed it. It was settled by a small group of Phoenix, separated from their clan&rsquo;s holdings by great distance and difficult geography. The family maintaining the small Phoenix school within the village eventually experienced a religious revelation that attracted the attention of the Imperial families. They were granted a charter as the Centipede Clan, partly out of respect for their piety and partly to simplify matters of taxation. The Centipede were among the first Minor Clans to pledge their service to the Mantis during a time of war, and when the Mantis became a Great Clan the Centipede joined them as the Moshi family.</p><p>The valley remains the Moshi family&rsquo;s principle holding. Outside of a few specific estates in the lands of other Mantis families, the Moshi control no other land. The valley is not exceptionally fertile, but since the Moshi are a small family, it easily handles the majority of their food requirements.</p>"
    }
  },
  {
    "id" : "P1",
    "name" : "City of Remembrance",
    "type" : "city",
    "pos" : [322.7759094238281, 132.11526489257812],
    "lblPos" : null,
    "provinceId" : "Phoenix-5",
    "owner" : "phoenix",
    "details": {
      "html" : "<p>Previously known as the City of Suffering, Toshi no Omoidasu has a strange and sometimes tragic history. Early in its history, it was home to a deadly maho-tsukai of such power that only a rare collaboration between the Jade Champion and the Elemental Council of Masters was able to defeat him. Even in death, however, he cursed the city with a powerful spell designed to ensure he could one day return. Centuries after the sorcerer&rsquo;s death, the city became home to the legendary Lion hero Matsu Hitomi, who spent her final days there. She was much beloved by the city&rsquo;s citizens, and after her death the city was renamed to remember her.</p> <p>Despite its strange history, or perhaps even because of it, Toshi no Omoidasu is a bustling center of commerce, one of the central lynchpins of the southern Phoenix provinces. It is one of the few locations where trade between the Mantis and Phoenix clans is conducted in any significant quantity, perhaps because the opportunity is simply too great to pass up even with centuries of bad blood between the two clans.</p>"
    }
  },
  {
    "id" : "P2",
    "name" : "City of Tears",
    "type" : "city",
    "pos" : [334.70587158203125, 46.274513244628906],
    "lblPos" : null,
    "provinceId" : "Phoenix-3",
    "owner" : "phoenix",
    "details": {
      "html" : "<p>Known by other names during its history, the City of Tears was one of five elemental cities constructed within the spirit realms by samurai whose souls had gone to Yomi, the Realm of Blessed Ancestors, after death. During a period of tumult and conflict with the spirit realms, the city moved into the mortal realm, although at the time it was under siege by evil spirits who slew all its inhabitants. The Phoenix initially declared the city sacred and restricted due to the pervasive sorrow that afflicted it, but eventually purged it of its evil influences and made it inhabitable once more.</p> <p>The City of Tears is unique in that it was completely constructed prior to any living Phoenix ever setting foot within its boundaries, and as such some of its buildings are complete mysteries. The Phoenix have made the city their own while at the same time respecting the entire settlement as sacred; no structures have been altered, removed, or added to the city since its purification was completed. Because of its supernatural origin, the city is a major center of learning for shugenja, particularly those who are attuned to the element of Water, with which the city was originally aligned.</p>"
    }
  },
  {
    "id" : "P3",
    "name" : "Kyuden Agashi",
    "type" : "castle",
    "pos" : [333.00140380859375, 138.60546875],
    "lblPos" : null,
    "provinceId" : "Phoenix-5",
    "owner" : "phoenix",
    "details": {
      "html" : "<p>Built following the Agasha family&rsquo;s defection to the Phoenix Clan, their new estate bears little resemblance to the one they abandoned in the Dragon lands, for the Agasha were never a particularly sentimental family. Their new home includes massive foundries for them to continue their history of magical experimentation, combining shugenja traditions with that of blacksmithing. Although the family is careful to administer the lands given them by the Phoenix in a proper manner, they have little attachment to anything outside their estate. Virtually all crafted objects and goods the Agasha need are created by members of the family or their trusted vassals in workshops contained in or below the castle. Kyuden Agasha has remarkable meager space devoted to diplomatic purposes, as the Agasha are keenly aware that many within the Empire have held them in very low regard since their controversial defection.</p>"
    }
  },
  {
    "id" : "P4",
    "name" : "Kyuden Asako",
    "type" : "castle",
    "pos" : [327.2548828125, 61.960784912109375],
    "lblPos" : null,
    "provinceId" : "Phoenix-2",
    "owner" : "phoenix",
    "details": {
      "html" : "<h3>Morning Glory Castle</h3> <p>Also known as Morning Glory Castle, Kyuden Asako is the most celebrated diplomatic estate in the Phoenix Clan, and historically has proven a popular site to host the Winter Court of the Emperor. This is somewhat ironic given the castle&rsquo;s relatively inaccessible location; although quite beautiful, the castle is built high atop a mountain, a design more befitting a military fortress. The castle is relatively small, significantly smaller than either Kyuden Isawa or Shiro Shiba, and is generally regarded as the standard example of the smallest possible size an estate could be and still host an Emperor&rsquo;s Winter Court.</p>"
    }
  },
  {
    "id" : "P5",
    "name" : "Kyuden Isawa",
    "type" : "castle",
    "pos" : [361.7646789550781, 49.803924560546875],
    "lblPos" : null,
    "provinceId" : "Phoenix-3",
    "owner" : "phoenix",
    "details": {
      "background" : "assets/images/details-bg-castle-phoenix.jpg",
      "html" : "<p>Kyuden Isawa and its associated city form one of the greatest centers of learning throughout all of Rokugan, and there are very few shugenja in the Empire who do not covet the chance to study there. Those who do not usually hold some manner of grudge against the Phoenix that prevents them from recognizing the value of doing so. As the home to the largest shugenja family of Rokugan, Kyuden Isawa devotes a tremendous amount of space to libraries, shrines, and temples, the majority of which deal with the constant training of new and inexperienced shugenja. An entirely separate tier of scholarly pursuit is available, however, for the more experienced and higher-ranking shugenja. The libraries, in particular, are carefully stratified so that young students cannot access the rare and powerful documents available to their senior kinsmen. The Phoenix are all too familiar with how power can corrupt those who are not ready to wield it.</p> <p>Unlike the other major Phoenix holdings, Kyuden Isawa has an elaborate set of sub-levels built into the stone below the castle. The greatest and deepest of these houses the sacred meeting room of the Council of Elemental Masters, a chamber that only the Masters and the Phoenix Champion are free to enter without an invitation.</p>"
    }
  },
  {
    "id" : "P6",
    "name" : "Nikesake",
    "type" : "village",
    "pos" : [301.62884521484375, 113.89958190917969],
    "lblPos" : null,
    "provinceId" : "Phoenix-5",
    "owner" : "phoenix",
    "details": {
      "html" : "<p>The small city of Nikesake exists as a testament to the longstanding alliance between the Crane and Phoenix clans. It was from this city that Phoenix forces once aided the Crane during one of the more severe conflicts in the long-running series of wars fought between the Crane and Lion over Toshi Ranbo. This act cemented an alliance that has endured for centuries, and the Crane hold significant estates within the city as well. Additionally, while Nikesake is not the Phoenix holding nearest to Otosan Uchi, it does have the easiest overland travel routes to that city, and as such often served as a waypoint for trade and commerce bound for that destination.</p> <p>In terms of its physical make-up, Nikesake&rsquo;s focus on trade makes it a remarkably wealthy city for its relatively small size. All the Phoenix families maintain estates there, and there is also a lavish Crane embassy and several smaller, less remarkable embassies from other clans. Particularly influential individuals within the Phoenix Clan often maintain private holdings in Nikesake, and it is common for one or more Elemental Masters to have personal estates in the area as well.</p>"
    }
  },
  {
    "id" : "P7",
    "name" : "Pale Oak Castle",
    "type" : "village",
    "pos" : [306.4705810546875, 69.4117660522461],
    "lblPos" : null,
    "provinceId" : "Phoenix-2",
    "owner" : "phoenix",
    "details": {
      "html" : "<p>Other than Kyuden Asako, Aoijiroi Oku Shiro is the most popular court for visitors to the Phoenix lands, and the only other one to have hosted an Emperor&rsquo;s Winter Court. The castle surrounds a grand white oak that grew over the grave of one of the Hantei Emperors. He abandoned tradition and asked on his deathbed to be buried at the site of his wife&rsquo;s birth. The castle was built, in part, to ensure the eternal defense of the sacred tree. The bark of the oak is rumored to have tremendous healing powers, and the few cuttings taken each season are greatly coveted.</p>"
    }
  },
  {
    "id" : "P8",
    "name" : "Shiro Shiba",
    "type" : "castle",
    "pos" : [353.1372375488281, 81.96078491210938],
    "lblPos" : null,
    "provinceId" : "Phoenix-5",
    "owner" : "phoenix",
    "details": {
      "html" : "<p>In the lands of a clan that attempts to eschew warfare as much as possible, Shiro Shiba is an anomaly: a prominent and significant fortress, by far the most martial settlement in the Phoenix provinces. In the eyes of a more conventionally martial minded family like the Matsu or the Hida, it might be considered no more than a secondary fortress or perhaps even a keep, but for the Shiba it is more than sufficient for their needs.</p> <p>To outsiders, the layout of Shiro Shiba is confusing and nonsensical, a winding labyrinth of gardens, courtyards, audience chambers, and other estate components, all thrown together in an apparently haphazard fashion. The Shiba seem to have no difficulty navigating the castle, but visitors without an escort can and frequently do become hopelessly lost. The absolute center of the castle is the legendary Sacred Heart Dojo, the oldest and most important training center maintained by the family.</p> <p>An important aspect of the castle that the Shiba keep to themselves is the presence of the Shrine of Champions, and elaborate shrine on the outskirts of the castle grounds that honors the memory of each individual Phoenix Clan Champion since the days of Shiba himself. Because Phoenix Champions are so rarely chosen along bloodlines and frequently rise from obscurity, rare is the Shiba samurai who cannot find one of his own ancestors honored somewhere within its walls.</p>"
    }
  },
  {
    "id" : "P9",
    "name" : "Shrine of the Ki-Rin",
    "type" : "shrine",
    "pos" : [295.8823547363281, 60],
    "lblPos" : null,
    "provinceId" : "Phoenix-2",
    "owner" : "phoenix",
    "details": {
      "html" : "<p>The sacred and enigmatic Ki-Rin is known to appear occasionally to worthy mortals over the course of the Empire&rsquo;s history. The Shrine was built in response to one such visitation. However, unlike most such occurrences, in this instance the person receiving the vision did not heed it; the shrine was built later, out of shame and penitence. The mountaintop site of the shrine&rsquo;s construction was chosen because, according to legend, it was also the site of the Ki-Rin&rsquo;s appearance in the dawn of the Empire, when the Ki-Rin Clan departed the Empire to follow Lady Shinjo.</p> <p>The shrine is located high on a mountain, and reaching it requires ascending a long series of paths and stairs. Thus, only the most devoted religious pilgrims make it up to the shrine to offer their veneration. However, the shrine does get visitors once a year when it hosts a famous Phoenix shugenja tournament, the Festival of the White Orchid.</p>"
    }
  },
  {
    "id" : "P10",
    "name" : "Twin Soul Temple",
    "type" : "temple",
    "pos" : [311.568603515625, 89.01960754394531],
    "lblPos" : null,
    "provinceId" : "Phoenix-5",
    "owner" : "phoenix",
    "details": {
      "html" : "<p>A venerable temple established centuries ago by the Order of Chikai, Twin Soul Temple has remained obscure through most of its history. In a tradition that would be unusual among most clans, the temple offers training facilities for bushi but also the customary libraries and shrines for shugenja. The training at the temple emphasizes the close bond between shugenja and yojimbo, teaching the bushi to protect his charge at all costs but also teaching the shugenja to value the counsel and courage of his bodyguard, protecting him in turn. The pairs of shugenja and yojimbo who train within this temple and pass their gempukku ceremony are among the most effective and cooperative samurai who serve the Phoenix Clan.</p>"
    }
  },
  {
    "id" : "P11",
    "name" : "Yobanjin Mura",
    "type" : "village",
    "pos" : [274.70587158203125, 36.86274337768555],
    "lblPos" : null,
    "provinceId" : "Phoenix-1",
    "owner" : "phoenix",
    "details": {
      "html" : "<p>The Scorpion are not the only clan to have secrets. Yobanjin Mura is an extremely well-kept secret, and a rather scandalous one should its nature ever be revealed. There is no samurai presence within Yobanjin Mura, which is a village only by the most generous interpretation of the term. Its small size and distance from established travel routes has kept it off of any maps, and while the Phoenix are always very careful to pay the appropriate taxes by slipping them in elsewhere in their annual tithes, no one outside the clan has ever been to the village; indeed, even very few even within the clan are aware of its existence. The reason for the village&rsquo;s secrecy is that many of its inhabitants are of mixed blood &ndash; they have Yobanjin blood somewhere in their immediate ancestry. Although contact between the Empire and the barbarian tribes to the north is rare and officially prohibited, occasional parties do range through the Great Wall of the North and into the northernmost regions of the Empire, leading sometimes to individuals such as those who dwell within Yobanjin Mura. For their part, the half-bloods of Yobanjin Mura feel somewhat blessed that the Phoenix have allowed them their own village far from the scorn of others, where they are left to their own devices. The only thing required of them in return is to maintain a modest level of trade with the occasional Yobanjin visitors. This trade is for relatively minor items that can be used in casting or researching spells.</p> <p>The Phoenix who administer the village rationalize the legality of Yobanjin Mura to themselves by pointing out that some of the Yobanjin tribes are descended from outcasts who fled the Empire more than one thousand years ago. This means they are not in fact gaijin, and therefore the Imperial edict forbidding unsanctioned trade with gaijin does not apply. Whether the Emerald Champion would see things the same way is another question, of course. </p>"
    }
  },
  {
    "id" : "SC1",
    "name" : "Beiden",
    "type" : "city",
    "pos" : [198.58824157714844, 232.8039093017578],
    "lblPos" : null,
    "provinceId" : "Scorpion-1",
    "owner" : "scorpion",
    "details": {
      "html" : "<p>The city of Beiden is a small and unremarkable place. Its people are simple, honest folk who live to serve the Emperor. Unfortunately, this city&rsquo;s close proximity with Beiden Pass, the Crossroads of the Empire, has caused it no end of trouble. The large and militarily vital mountain pass, connecting the Empire north to south for a thousand years, was both a curse and a blessing. Beiden has been devastated by war more often than not, a fact its inhabitants seem to take in stride. Throughout most of its history, the city also enjoyed significant prosperity due to its proximity to the pass, and its citizens enjoyed this wealth despite the constant threat of living next to the only pass large enough to move an army through the Spine of the World Mountains.</p><p>In modern times, after Beiden Pass was destroyed, the city&rsquo;s fortunes changed considerably and it became safer but also far less prosperous. More and more of its citizens departed the city to seek their fortunes elsewhere, and by the time the much smaller Shamate Pass was discovered and opened in the late twelfth century, Beiden was a shadow of its former self. Shamate Pass allows for small amounts of trade to pass through the mountains, and it has halted the decay at Beiden, but the city is unlikely to regain its former glory.</p>"
    }
  },
  {
    "id" : "SC2",
    "name" : "Hotei Seido",
    "type" : "temple",
    "pos" : [221.76470947265625, 252.94114685058594],
    "lblPos" : null,
    "provinceId" : "Scorpion-3",
    "owner" : "scorpion",
    "details": {
      "html" : "<p>The Fortune of Contentment deserves a temple as cozy and comfortable as the aspect of life it watches over. This view is embraced to full effect by the monks who built and maintain the shrine to Hotei. Beautiful sculptures, paintings, and scrolls line its walls, all dedicated to the finer points of life. The fact that this shrine is small and modestly appointed compared to some of the other major Fortunes&rsquo; shrines in other Great Clan lands does not bother the monks who maintain it.</p> <p>Some find it strange that the Scorpion lands are home to the most prominent shrine to the Fortune of Contentment, but the Scorpion themselves consider this perfectly appropriate. A samurai who lives a life of absolute loyalty to his lord has nothing but contentment in his soul, for he knows how great will be his rewards in the next life. For this reason more than any other, a tremendous number of Scorpion visit the shrine each year, and the donations to the brothers who maintain it are well in excess of any other major temple within the Scorpion provinces.</p>"
    }
  },
  {
    "id" : "SC3",
    "name" : "Kyuden Bayushi",
    "type" : "castle",
    "pos" : [188.43136596679688, 240.3921356201172],
    "lblPos" : null,
    "provinceId" : "Scorpion-1",
    "owner" : "scorpion",
    "details": {
      "html" : "<p>The Bayushi family castle is also the center of Scorpion political affairs. The Scorpion Clan Champion calls the castle home, and manages the clan&rsquo;s affairs from within its well-protected walls. Its court chambers are among the finest in the Empire, and a splendid garden is located outside, rivaling the beauty of the Crane gardens in Kyuden Doji. In a truly eccentric move, many of the interior walls are moveable, allowing the Scorpion to change the castle&rsquo;s interior layout at their whim.</p> <p>An appointment to Kyuden Bayushi is generally considered highly prestigious, and the Scorpion are generous and pleasant hosts &ndash; but such a mission is also more than a little risky, for in Scorpion lands politics is truly a blood sport. Ambassadors sent to represent their clans at Kyuden Bayushi must be extremely seasoned and experienced. For their part, the Scorpion prefer to invite guests who either have something the Scorpion want, or who are considered threats the clan wishes to keep close at hand. Neither is a particularly envious position for a samurai to find himself in.</p> <p>In addition to its function as the clan&rsquo;s primary court, Kyuden Bayushi is also the Scorpion Clan&rsquo;s most prominent fortress, capable of withstanding siege from large armies. It is built atop a low plateau in the center of an open plan, making it impossible for hostile forces to approach undetected. The plateau is riddled with secret passages and tunnels, allowing the Scorpion to come and go unobserved. Despite the many assaults the Scorpion provinces have endured, the castle has only ever truly fallen once, during a period when the clan was dissolved by Imperial edict and its denizens forced to flee or hide.</p>"
    }
  },
  {
    "id" : "SC4",
    "name" : "Ryoko Owari Toshi",
    "type" : "city",
    "pos" : [169.60784912109375, 222.35292053222656],
    "lblPos" : null,
    "provinceId" : "Scorpion-1",
    "owner" : "scorpion",
    "details": {
      "html" : "<p>Ryoko Owari, also known as the City of Lies, the City of Stories, and the City of Green Walls, is said to be the home of every vice, sin, and guilty pleasure found within the Emerald Empire. The city turns a notoriously blind eye to criminal activities of every type, from gambling dens to illegal trade. Control of the city has changed hands many times over the centuries, with the Unicorn in particular ruling it on more than one occasion, and the Crab and Lion each briefly occupying it as well. However, it always seems to return to the hands of its Scorpion masters. Perhaps only they can properly rule over such a place.</p> <p>Although the exact dimensions and populations of major cities change from decade to decade, the City of Lies is usually counted at around 10,000 people and is generally considered the second largest city in the Empire, smaller only than the Imperial capital. This is a point of contention between the Scorpion and the Mantis, who believe that the city of Kyuden Gotei is larger than the City of Lies, but so many more people are familiar with Ryoko Owari that its position can never be unseated within the public consciousness.</p> <p>Ryoko Owari straddles the River of Gold, the major river trade route of the western Empire, and is home to countless merchants. Perhaps more importantly, the fields surrounding the city are particularly well suited toward growing poppies, and the City of Lies is the center of the Empire&rsquo;s legal opium production and trade. The drug is used for a number of medicinal purposes throughout Rokugan, and is a major source of commerce for the Scorpion Clan. There are those who speculate, however, as to why the merchants of the city grow many times more poppies than are necessary to produce the required amount of medicinal opium. Still, such topics are never addressed in polite company.</p>"
    }
  },
  {
    "id" : "SC5",
    "name" : "Shiro No Shosuro",
    "type" : "castle",
    "pos" : [174.313720703125, 250.19606018066406],
    "lblPos" : null,
    "provinceId" : "Scorpion-2",
    "owner" : "scorpion",
    "details": {
      "background" : "assets/images/details-bg-castle-scorpion-2.jpg",
      "html" : "<p>The home of the Shosuro family seems to be a normal castle at first glance. Any who know enough of the family&rsquo;s reputation to look closer, however, will find that nothing is what it appears to be. The palace is filled with masked actors and smiling assassins, and those assigned to the courts here often regard it as a more dangerous assignment than a battlefield.</p> <p>One of the few obviously noteworthy aspects of the castle, and indeed perhaps its most famous features, are the beautiful gardens that fill so much of the available space within. It is said that Shiro no Shosuro, also called the Castle of Pretending, has the largest gardens of any castle in the Empire, and few who have visited contest the claim (at least not while they are in attendance). In addition to being a source of exquisite beauty, however, the gardens have a more nefarious role. By repute, this is where the Scorpion concoct their most sinister poisons, although this rumor is never discussed publicly. One legend has it that the castle was once put to the torch by an enemy army, and the entire army was killed by the vapors that emerged from the burning garden.</p> <p>A village near the castle is home to the famous Shosuro Acting School and the many theater troupes that it trains. Thus, while many samurai fear to visit Shiro no Shosuro, actors from across the Empire eagerly seek invitations to its acting school, which is almost as well regarded as the acting branch of the Kakita Artisan Academy.</p>"
    }
  },
  {
    "id" : "SC6",
    "name" : "Shiro No Soshi",
    "type" : "castle",
    "pos" : [188.11764526367188, 206.52940368652344],
    "lblPos" : null,
    "provinceId" : "Scorpion-1",
    "owner" : "scorpion",
    "details": {
      "background" : "assets/images/details-bg-castle-scorpion.jpg",
      "html" : "<p>The Soshi family castle is constructed high amid the peaks of the Spine of the World Mountains, close to the Lion and Unicorn lands. The proximity of such enemies meant the Scorpion Clan was forced to take practicality into far more account than style when designing this castle. Its mountainous location ensures it cannot be approached by a force of any significant size, granting it relative security so long as even a meager defense force is on hand to protect the passes leading to its gates. The castle&rsquo;s high towers loom over every other construction in the area, of which there are few, and are supplemented by additional tall watchtowers on every side. It is rumored the watchtowers are among the tallest constructs in the Empire, although doubtless not even the Scorpion would commit such a breach of etiquette as to make them taller than the Imperial Palace. Due to their great height and unusually narrow design, the Scorpion spent vast sums of money hiring Kaiu engineers to ensure they could withstand the mountains winds.</p> <p>Warriors stationed in the Soshi towers&rsquo; peaks can spot the southernmost Lion lands, giving the Scorpion Clan precious warning before any incursion from their northern neighbors can take place. Although they ostensibly serve the clan as shugenja, in truth the Soshi are the Scorpion&rsquo;s jack-of-alltrades, maintaining an extensive network of skills throughout their ranks. For this reason, their estate is sometimes known as the Castle of Organization.</p>"
    }
  },
  {
    "id" : "SC7",
    "name" : "Seven Stings Keep",
    "type" : "tower",
    "pos" : [213.5294189453125, 239.99998474121094],
    "lblPos" : null,
    "provinceId" : "Scorpion-1",
    "owner" : "scorpion",
    "details": {
      "html" : "<p>The military masterminds of the Scorpion Clan reside within Seven Stings Keep. The castle is nestled at the foot of the Spine of the World Mountains, with easy access to most of the mountain passes that provide access to the Scorpion lands. Seven Stings Keep is widely recognizable for its very visible seven high towers. The tower roofs are sharp and foreboding, serving to remind the clan&rsquo;s enemies that the Scorpion are always ready to strike at their foes.</p> <p>Militaristic clans like the Lion do not generally regard the Scorpion as a military threat, believing their victories come only as a result of underhanded and dishonorable tactics. However, any of their leaders who saw the interior of Seven Stings Keep might be sorely tempted to revise that opinion. The tacticians of Seven Stings understand that strategies can only be part of an overall military approach, and as such they maintain extensive diagrams and reproductions of troops, army movements, and terrain details of all the clan&rsquo;s current and potential enemies. Each Great Clan has a single chamber devoted to it where Scorpion analysts study that clan alone, constantly striving to update their information and formulate new strategies to deal with them in the event a conflict happens.</p>"
    }
  },
  {
    "id" : "SC8",
    "name" : "Palace of Crimson Shadows",
    "type" : "castle",
    "pos" : [178.23529052734375, 308.62744140625],
    "lblPos" : null,
    "provinceId" : "Scorpion-4",
    "owner" : "scorpion",
    "details": {
      "html" : "<p>The Palace of Crimson Shadows was constructed to serve as a secondary training facility for the Bayushi courtiers, and if necessary to serve as a second possible location for the Scorpion to host the Emperor&rsquo;s Winter Court. The intense and refined design that went into the castle is obvious in every opulent inch. The Scorpion Clan spared no expense to make life comfortable for visitors coming to the Bayushi provinces, while still making sure their own influence is seen in every room of the stronghold. Thus, while the palace is seemingly a wide-open and inviting place, every corridor is lined with dark red lanterns, giving a sinister tinge to the whole building. This is one of the most fundamental lessons the sensei here teach to their students: control the perceptions of your friends and enemies, and you can manipulate both of them all the easier.</p> "
    }
  },
  {
    "id" : "SC9",
    "name" : "Yogo Shiro",
    "type" : "city",
    "pos" : [186.07843017578125, 219.6078338623047],
    "lblPos" : null,
    "provinceId" : "Scorpion-1",
    "owner" : "scorpion",
    "details": {
      "html" : "<p>The estate of the Yogo family is often overlooked by everyone &ndash; Scorpion and non-Scorpion alike &ndash; as insignificant in comparison to the family dojo at the Yogo Towers. Little importance is placed on the Yogo family estate, nestled as it is in the middle of the empty, remote Yogo provinces.</p> <p>The Hidden Moon Dojo, a secret society of Yogo shugenja dedicated to studying and fighting the Lying Darkness and other enemies in the shadows, often holds council here. The Hidden Moon does not have any formal lands of its own, and usually relies on Yogo Shiro to serve as host.</p>"
    }
  },
  {
    "id" : "SC10",
    "name" : "Yogo Towers",
    "type" : "tower",
    "pos" : [197.05882263183594, 213.72547912597656],
    "lblPos" : null,
    "provinceId" : "Scorpion-1",
    "owner" : "scorpion",
    "details": {
      "html" : "<p>The Yogo family shugenja dojo is actually more famous than the family estates. The Towers themselves look both imposing and dangerous, as if designed to deter any visitors who might appear in the area. Most Yogo spend a great portion of their lives inside the Tower&rsquo;s halls, struggling to gain a mastery of the kami. The library inside the Towers is of modest size, but provides extensive information on the subjects that interest the Yogo family: curses, black magic, and the methods of preventing such things.</p>"
    }
  },
  {
    "id" : "U1",
    "name" : "Dark Edge Village",
    "type" : "village",
    "pos" : [117.45098114013672, 121.17646789550781],
    "lblPos" : null,
    "provinceId" : "Unicorn-6",
    "owner" : "unicorn",
    "details": {
      "html" : "<p>For much of Rokugan's history, the Unicorn provinces were unaligned lands shared between the Lion and Scorpion Clans. Dark Edge village was a small, out of the way settlement that was overlooked by the Lion as largely insignificant. After the creation of the Emerald Champion position, an early Hantei Emperor chose Dark Edge Village as the site for the tournament where his Champion would be selected. The Emerald Championship was held within the village numerous times throughout history, although eventually it would be moved elsewhere to break the power of a particularly influential regent acting in the name of a missing Emerald Champion. Although the village has not since been host to the tournament, the pervasive interest and dedication of the people there has not changed, and the chief dojo remains the pre-eminent iaijutsu training facility in all the Unicorn holdings. The Ide family maintains an estate within the village in order to supervise the training of their yojimbo; while they understand the necessity of trained duelists in resolving courtly disputes, they hope to mitigate the aggressive martial training and ensure their personal champions remember their ultimate cause is one of peace.</p>"
    }
  },
  {
    "id" : "U2",
    "name" : "Mountain Watch Keep",
    "type" : "castle",
    "pos" : [37.45098114013672, 80],
    "lblPos" : null,
    "provinceId" : "Unicorn-5",
    "owner" : "unicorn",
    "details": {
      "background" : "assets/images/details-bg-castle-unicorn.jpg",
      "html" : "<p>A relatively recent addition to the Shinjo holdings, Mountain Watch Keep is situated where the plains meet the Great Wall of the North, a region that has generally been undeveloped because of its lack of immediately accessible resources. After a particularly disastrous incursion from the northern steppes by a massive Yobanjin army, an incursion in which the Unicorn suffered significant losses, the family constructed this keep to maintain a watch over the northern passes and ensure there would be ample warning before a force of any size could gain access to the clan's lands. The keep itself is not particularly large, and cannot house a military force of any significant size. The intent behind its construction is simply to hold enough troops for a minor delaying action, either hit and run tactics or, if necessary, a suicide attack to clear the mountain passes and collapse them upon an advancing enemy. At the same time, couriers on the clan's fastest horses would be deployed along well-practiced routes to the nearest large fortifications, summoning larger military forces in a timely manner. Thus far the system has not been put to the test, but the drills conducted by the Shinjo family indicate it should prove an effective means of strong, immediate defense against further incursion from the north.</p>"
    }
  },
  {
    "id" : "U3",
    "name" : "Shinden Horiuchi",
    "type" : "temple",
    "pos" : [85.29412078857422, 147.4509735107422],
    "lblPos" : null,
    "provinceId" : "Unicorn-2",
    "owner" : "unicorn",
    "details": {
      "html" : "<p>The primary holding of the small Horiuchi family, Shinden Horiuchi has always been more of a temple than a castle. Even at its peak, the tiny Horiuchi family never had more than two to three dozen samurai and thus never had need of a larger holding. The temple, surrounded by a moderately sized village, has all the amenities one would expect, with the addition of considerably larger living space to accommodate not only the family and any guests they might have, but also the orphans the family is known for taking in. The first Horiuchi, a woman named Shoan, was a caretaker for the Clan Champion&rsquo;s children, and her love of children became an integral part of the family&rsquo;s philosophy. After a series of Empire-wide conflicts left many tens of thousands dead, Shoan and her followers made it their mission to find and take in any and all children who were left without parents and had no one else to take care of them. The number of children who came to the family was at first only a few dozen, but with increasing conflicts throughout the family&rsquo;s history, the number climbed steadily over the years. Most of these children choose to swear fealty to the family when they come of age, and are welcomed into the clan without reservation.</p>"
    }
  },
  {
    "id" : "U4",
    "name" : "Shinomen Tower",
    "type" : "tower",
    "pos" : [58.6274528503418, 202.74510192871094],
    "lblPos" : null,
    "provinceId" : "Unicorn-2",
    "owner" : "unicorn",
    "details": {
      "html" : "<p>Southwest of the Unicorn provinces lies the vast and mysterious Shinomen Mori, the largest forest in the known world. Its depths have never been fully explored, and many have entered in search of its mysteries and never returned. There are things within that no man has ever seen, and occasionally creatures that completely defy description emerge from the forest&rsquo;s depths. Rather than run the risk of having the clan&rsquo;s lands jeopardized by such enigmatic threats, the lords of the Unicorn established a watchtower to supervise the northern border, capable both of sending word north in the event of disaster and of defending the clan borders against smaller incursions. The fortification consists primarily of a tower (significantly taller than most of its type due to the need to survey an extremely long tree line) and a moderately sized barracks capable of housing up to one hundred men. During those periods of Rokugan&rsquo;s history when the Naga race has been awake and active in their cities deep within the Shinomen, the tower serves as a waypoint between their civilization and those humans, Unicorn or otherwise, they might consider their allies.</p>"
    }
  },
  {
    "id" : "U5",
    "name" : "Shiro Ide",
    "type" : "castle",
    "pos" : [52.74509811401367, 174.03921508789062],
    "lblPos" : null,
    "provinceId" : "Unicorn-2",
    "owner" : "unicorn",
    "details": {
      "background" : "assets/images/details-bg-castle-unicorn-2.jpg",
      "html" : "<p>By far the most conventionally constructed castle in the entire Unicorn provinces, Shiro Ide is the clan&rsquo;s center for diplomatic training and negotiations. Shiro Moto (and in earlier eras, Shiro Shinjo) remains the capital and often hosts important guests, but when matters of a more delicate nature arise, Great Day Castle is the preferred host. The castle&rsquo;s familiar style and d&eacute;cor, not to mention its extremely beautiful surroundings, put guests more at ease than the strangely alien world of the Unicorn capital.</p><p>Shiro Ide is among the least military-oriented estates in all of Rokugan, with only the most basic defenses demanded by the lords of the Unicorn Clan. The Ide themselves are extremely pacifistic in philosophy, or at least as much as a samurai can be a pacifist, and their attitudes are more in keeping with the ideals of the Phoenix Clan or the Asahina family of the Crane than with their warlike cousins among the rest of the Unicorn. The vast majority of all court representatives for the Unicorn Clan are trained within Shiro Ide, learning how to put into practice the ideas the family collected from interacting with dozens of unique cultures during their years spent wandering the Burning Sands.</p><p>Early in the family&rsquo;s history, the Ide maintained their own shugenja tradition, with a unique emphasis on spatial magic. In the modern Empire, however, those practices have largely been folded into the standard Iuchi techniques, and the Ide do not maintain their own temple any longer.</p>"
    }
  },
  {
    "id" : "U6",
    "name" : "Shiro Iuchi",
    "type" : "castle",
    "pos" : [113.13725280761719, 163.5294189453125],
    "lblPos" : null,
    "provinceId" : "Unicorn-4",
    "owner" : "unicorn",
    "details": {
      "html" : "<p>Also known as Gatherer of Winds Castle, Shiro Iuchi is the Unicorn Clan's center for shugenja training and research. The castle boasts much of the same unusual construction as other major Unicorn estates, such as onion-shaped domes atop its towers, but the many temples and shrines incorporated into its confines are more traditional, making it a bit more welcoming to outsiders. The Iuchi family's emphasis on unusual forms of magic has made them somewhat less than open to visitors and students from outside the clan. There are many who covet the secrets they believe the Iuchi possess, and just as many whose narrow view of magic would make them vilify the Iuchi family for blasphemy. Keenly aware of the potential dangers, the Iuchi always extend an invitation to a new Jade Champion shortly after his appointment, opening their doors and secrets to him in order to gain the assurances of the Empire's highest authority on magic that there is no danger of heresy within their walls.</p><p>The Iuchi are somewhat less accepting of the Moto family's zeal for the magical practices associated with the gaijin gods known as the Lords of Death, but after these are declared non-heretical by Imperial edict, the Iuchi begin incorporating temples to the Lords into their estate as well.</p>"
    }
  },
  {
    "id" : "U7",
    "name" : "Shiro Moto",
    "type" : "castle",
    "pos" : [97.8431396484375, 109.01960754394531],
    "lblPos" : null,
    "provinceId" : "Unicorn-6",
    "owner" : "unicorn",
    "details": {
      "html" : "<p>The seat of the Moto family, Shiro Moto, sits amid a region known as the Field of the Winds, chosen as the site of the castle because its chill temperature reminded the family of the steppes from which their ancestors originated. The castle is visible for miles around, not only because of its large size, but also because of its completely alien architecture. With the possible exception of some strange structures on the Mantis Islands, Shiro Moto is by far the most unusual construction in the whole of Rokugan. Its large, bulbous spires would be more at home in the strange lands north of the Empire, across the vast desert known as the Burning Sands.</p><p>The castle is a major military installation for the Unicorn Clan. From here emerged the concept of forming the Unicorn military into three armies, the offensive Khol, the defensive Junghar, and the shugenja-intensive Baraunghar. After the defeat of the Dark Moto, this castle becomes the capital of the entire Unicorn Clan, gaining significant political importance. Additionally, the castle is also the center for the worship of the Shi-Tien Yen-Wang, the ancient gaijin gods worshipped by the Moto as the Lords of Death. Initially regarded as blasphemous by the rest of the Empire, the Lords were adopted into the Rokugani cosmology in the mid-twelfth century for services rendered in the name of the Fortunes in Tengoku. In modern times a small but growing sect of Rokugani revere them as lesser Fortunes. The greatest temple and center for learning of the Lords of Death is located within the halls of Shiro Moto.</p>"
    }
  },
  {
    "id" : "U8",
    "name" : "Shiro Shinjo",
    "type" : "castle",
    "pos" : [89.21568298339844, 78.13725280761719],
    "lblPos" : null,
    "provinceId" : "Northlands-4",
    "owner" : "unicorn",
    "details": {
      "html" : "<p>Far Traveler Castle, as Shiro Shinjo is also known, was for centuries the diplomatic and governmental hub of the Unicorn lands. As befitting the family it serves, the castle is not particularly large, although its architectural style could best be described as eclectic. The castle is triangular in shape, ascending to three separate towers, and incorporating architectural elements from many different cultures the Unicorn encountered during their travels abroad. The castle's appearance is a distraction, however, that belies its strategic value as a stronghold. There are few other locations in the Unicorn lands as heavily and effectively fortified as Shiro Shinjo.</p><p>Like other major Unicorn estates, the castle has a stable vastly larger than one could expect to find attached to a similarly sized estate elsewhere in the Empire. Although the Shinjo do not place the same nigh-religious importance upon their steeds as the Utaku, they do regard them with more value and compassion than the other families. The average Shinjo bushi looks upon his horse as an ally or brother more than as a beast of burden. While the Shinjo were the lords of the clan for most of Rokugan's history, shortly after the Clan War in the early twelfth century they were removed from power by the returned Kami, Shinjo herself. She was disgusted by the degree to which the heretical Kolat organization had subverted her family. Although the family has worked hard to purge such influences from its ranks, many in the modern Empire continue to look upon the Shinjo with bias despite the Moto's endorsement of their purity.</p>"
    }
  },
  {
    "id" : "U9",
    "name" : "Shiro Utaku Shojo",
    "type" : "city",
    "pos" : [114.31372833251953, 88.23529052734375],
    "lblPos" : null,
    "provinceId" : "Northlands-4",
    "owner" : "unicorn",
    "details": {
      "html" : "<p>There are poets and storytellers throughout the Empire&rsquo;s history who refer to the Utaku Plains where Shiro Utaku Shojo stands as the most beautiful place in Rokugan. The plains seem endless, stretching out from horizon to horizon with almost nothing to interrupt the majestic view. The Utaku are among the most pious of all bushi families, and as part of their unique philosophy they have tremendous reverence for their homeland, cultivating it only to the extent necessary to fulfill their duties. The majority of developed land consists of small villages and towns with very carefully constrained fields where the maximum amount of foodstuff can be harvested, not only for the people of the provinces, but for the sacred herds of the legendary Utaku steeds as well.</p> <p>The majestic Utaku steeds have vast tracts of land set aside for their use, far more than the peasants or even samurai make use of. They have the perfect environment to grow and prosper, both before they are trained and in between their tours of duty. Shiro Utaku Shojo sits amid these ample plains, and is much more a part of the landscape than most castles.</p>"
    }
  },
  {
    "id" : "I1",
    "name" : "Castle of the Emerald Champion",
    "type" : "castle",
    "pos" : [325.5504150390625, 156.2525177001953],
    "lblPos" : null,
    "provinceId" : "Imperial-1",
    "owner" : "imperial",
    "details": {
      "html" : "<p>This rather lavish castle is the personal estate of the Emerald Champion, maintained very carefully by each individual Champion and his staff to be turned over to the Champion&rsquo;s successor upon the end of his service to the Empire. Because of the nature of the Emerald Championship, this estate is in the hand of individuals for decades at a time, although it is not altogether uncommon for a violent end to cut an individual&rsquo;s occupation of the castle quite short indeed. Likewise, the duties of an Emerald Champion take him all across the Empire, which can mean that months or even years go by with no significant period of the castle being occupied by its master. Still, perhaps because of the prestige associated with the position, most Emerald Champions prefer to leave their mark on the castle in some way, adding something to its d&eacute;cor or character in some way. Since so many different clans have had representatives among the ranks of former Emerald Champions, the castle is among the most uniquely and diversely decorated in the Empire. In addition to the actual castle itself, the estate includes a rather extensive barracks and training facility as part of the compound, which is where many young samurai honored with an appointment as Emerald Magistrates are brought. Small units from within the Imperial Legions are also trained here, but for the most part such things are reserved for another site specific to Legion training elsewhere. The Ruby Champion, the master sensei who trains the Emerald Champion&rsquo;s forces, has a small estate adjoining the castle as well.</p>"
    }
  },
  {
    "id" : "I2",
    "name" : "Hub Village",
    "type" : "village",
    "pos" : [328.68768310546875, 182.919189453125],
    "lblPos" : "none",
    "provinceId" : "Imperial-2",
    "owner" : "imperial",
    "details": {
      "html" : "<p>There are four Hub Villages, the North, South, East, and West villages that surround the outskirts of Otosan Uchi, the former Imperial City. During the period when Otosan Uchi was the Imperial City, the Hub Villages were major centers of trade and commerce for goods coming into and leaving the city, particularly because such things were distasteful for many of the samurai who dwelled within the city proper. Due to the slowed growth of the city and the limited housing suitable for those of samurai birth, the Hub Villages were also an opportunity for those who could not acquire housing within the city to have a personal estate near the city borders. Commuters from the Hub Villages were a common sight during the city&rsquo;s heyday, and even now that the Imperial City has been changed to Toshi Ranbo, the Hub Villages remain important centers of trade and commerce. The presence of the port at Otosan Uchi and the lack of a major port at Toshi Ranbo, the new Imperial City, means that a great deal of trade still passes through the region despite the destruction of the city proper. In fact, the fortunes of those who dwell within the Hub Villages has actually increased since Otosan Uchi&rsquo;s death. The Northern Hub Village is home to several major shipwrights sponsored by the Mantis Clan. The Southern Hub Village is protected by the Yotsu family, a former sect of ronin defenders of the weak who have since been accepted as vassals of the Seppun and who continue to protect the denizens of the Hub Villages. East Hub Village is home to the East Wind, a group of ronin allied with the Shinjo family of the Unicorn Clan. The West Hub Village is home to holdings of the Oriole Clan and several private holdings of the Dragon Clan.</p>"
    }
  },
  {
    "id" : "I3",
    "name" : "Hub Village",
    "type" : "village",
    "pos" : [320.84454345703125, 197.82115173339844],
    "lblPos" : "none",
    "provinceId" : "Imperial-2",
    "owner" : "imperial",
    "details": {
      "html" : "<p>There are four Hub Villages, the North, South, East, and West villages that surround the outskirts of Otosan Uchi, the former Imperial City. During the period when Otosan Uchi was the Imperial City, the Hub Villages were major centers of trade and commerce for goods coming into and leaving the city, particularly because such things were distasteful for many of the samurai who dwelled within the city proper. Due to the slowed growth of the city and the limited housing suitable for those of samurai birth, the Hub Villages were also an opportunity for those who could not acquire housing within the city to have a personal estate near the city borders. Commuters from the Hub Villages were a common sight during the city&rsquo;s heyday, and even now that the Imperial City has been changed to Toshi Ranbo, the Hub Villages remain important centers of trade and commerce. The presence of the port at Otosan Uchi and the lack of a major port at Toshi Ranbo, the new Imperial City, means that a great deal of trade still passes through the region despite the destruction of the city proper. In fact, the fortunes of those who dwell within the Hub Villages has actually increased since Otosan Uchi&rsquo;s death. The Northern Hub Village is home to several major shipwrights sponsored by the Mantis Clan. The Southern Hub Village is protected by the Yotsu family, a former sect of ronin defenders of the weak who have since been accepted as vassals of the Seppun and who continue to protect the denizens of the Hub Villages. East Hub Village is home to the East Wind, a group of ronin allied with the Shinjo family of the Unicorn Clan. The West Hub Village is home to holdings of the Oriole Clan and several private holdings of the Dragon Clan.</p>"
    }
  },
  {
    "id" : "I4",
    "name" : "Hub Village",
    "type" : "village",
    "pos" : [340.84454345703125, 181.7427215576172],
    "lblPos" : "none",
    "provinceId" : "Imperial-2",
    "owner" : "imperial",
    "details": {
      "html" : "<p>There are four Hub Villages, the North, South, East, and West villages that surround the outskirts of Otosan Uchi, the former Imperial City. During the period when Otosan Uchi was the Imperial City, the Hub Villages were major centers of trade and commerce for goods coming into and leaving the city, particularly because such things were distasteful for many of the samurai who dwelled within the city proper. Due to the slowed growth of the city and the limited housing suitable for those of samurai birth, the Hub Villages were also an opportunity for those who could not acquire housing within the city to have a personal estate near the city borders. Commuters from the Hub Villages were a common sight during the city&rsquo;s heyday, and even now that the Imperial City has been changed to Toshi Ranbo, the Hub Villages remain important centers of trade and commerce. The presence of the port at Otosan Uchi and the lack of a major port at Toshi Ranbo, the new Imperial City, means that a great deal of trade still passes through the region despite the destruction of the city proper. In fact, the fortunes of those who dwell within the Hub Villages has actually increased since Otosan Uchi&rsquo;s death. The Northern Hub Village is home to several major shipwrights sponsored by the Mantis Clan. The Southern Hub Village is protected by the Yotsu family, a former sect of ronin defenders of the weak who have since been accepted as vassals of the Seppun and who continue to protect the denizens of the Hub Villages. East Hub Village is home to the East Wind, a group of ronin allied with the Shinjo family of the Unicorn Clan. The West Hub Village is home to holdings of the Oriole Clan and several private holdings of the Dragon Clan.</p>"
    }
  },
  {
    "id" : "I5",
    "name" : "Hub Village",
    "type" : "village",
    "pos" : [323.1974792480469, 189.97801208496094],
    "lblPos" : "none",
    "provinceId" : "Imperial-2",
    "owner" : "imperial",
    "details": {
      "html" : "<p>There are four Hub Villages, the North, South, East, and West villages that surround the outskirts of Otosan Uchi, the former Imperial City. During the period when Otosan Uchi was the Imperial City, the Hub Villages were major centers of trade and commerce for goods coming into and leaving the city, particularly because such things were distasteful for many of the samurai who dwelled within the city proper. Due to the slowed growth of the city and the limited housing suitable for those of samurai birth, the Hub Villages were also an opportunity for those who could not acquire housing within the city to have a personal estate near the city borders. Commuters from the Hub Villages were a common sight during the city&rsquo;s heyday, and even now that the Imperial City has been changed to Toshi Ranbo, the Hub Villages remain important centers of trade and commerce. The presence of the port at Otosan Uchi and the lack of a major port at Toshi Ranbo, the new Imperial City, means that a great deal of trade still passes through the region despite the destruction of the city proper. In fact, the fortunes of those who dwell within the Hub Villages has actually increased since Otosan Uchi&rsquo;s death. The Northern Hub Village is home to several major shipwrights sponsored by the Mantis Clan. The Southern Hub Village is protected by the Yotsu family, a former sect of ronin defenders of the weak who have since been accepted as vassals of the Seppun and who continue to protect the denizens of the Hub Villages. East Hub Village is home to the East Wind, a group of ronin allied with the Shinjo family of the Unicorn Clan. The West Hub Village is home to holdings of the Oriole Clan and several private holdings of the Dragon Clan.</p>"
    }
  },
  {
    "id" : "I6",
    "name" : "Iyotisha",
    "type" : "city",
    "pos" : [57.05882263183594, 242.74508666992188],
    "lblPos" : "none",
    "provinceId" : "Spider-2",
    "details": {
      "html" : "<h3>City of Astronomy</h3><p>The race of serpent men known as the Naga existed long before the rise of mankind in the mortal realm, and while their time has passed, their mark is still upon the world they left behind in the form of the great cities that they created for each of their people's major bloodlines. Iyotisha, the City of Astronomy, was the home of the Constrictor bloodline, the rarest and least numerous of the Naga people. The Constrictors were the priests and judges of the Naga race, those who communed with the forces of their cosmology and used that wisdom for the betterment of their people. They were healers and sages, and their fewer numbers signaled the slow decline of the Naga race, one of the many reasons that they entered their Great Sleep during the final days of their empire. During a particularly tumultuous time in Rokugan's history, the Naga awoke from their Great Sleep to assist in facing a terrible foe that threatened the Empire. Unfortunately, the City of Astronomy was discovered to have been lost to the ravages of time. Few if any Constrictors awakened, and fewer still seemed to have survived the Sleep itself. The City of Astronomy remains in ruin, lost to time even to the Naga people.</p>"
    }
  },
  {
    "id" : "I7",
    "name" : "Kyuden Miya",
    "type" : "castle",
    "pos" : [110.39215850830078, 183.13723754882812],
    "lblPos" : null,
    "provinceId" : "Unicorn-3",
    "owner" : "imperial",
    "details": {
      "html" : "<p>The ancestral home of the Miya family is located far from the majority of Imperial holdings, an oddity that makes little sense to many until they consider that the Miya have chosen a location that allows for more centralized distribution of information, something that is extremely important to the family that serves as the heralds of the Emperor. Their castle is near the Unicorn lands, and they make ample use of the vast plains in their holdings to raise and train a massive herd of exceptional riding horses, many descended from a handful of bloodlines given them by the Unicorn shortly after that clan&rsquo;s return to the Empire. These horses are vital to the execution of the Miya family&rsquo;s duties, and allow them to reach all across the Empire in relatively short order. Unsurprisingly, Kyuden Miya is home to one of the largest stables in the Empire, certainly larger than any found outside the Unicorn provinces and the Imperial City. The lord of the castle is the Miya family daimyo, but since that position is almost always synonymous with that of the Imperial Herald, it is rare for the daimyo to be in attendance at the castle for any long period of time. For that reason, the Miya daimyo typically chooses a gifted hatamoto to oversee his affairs, and this person serves as governor of the Miya province in the daimyo&rsquo;s absence.</p>"
    }
  },
  {
    "id" : "I8",
    "name" : "Kyuden Otomo",
    "type" : "castle",
    "pos" : [308.7843017578125, 198.4313507080078],
    "lblPos" : null,
    "provinceId" : "Imperial-2",
    "owner" : "imperial",
    "details": {
      "html" : "<p>The ancestral estate of the Otomo family existed within Otosan Uchi for over a thousand years while that was the home of the Imperial City. The Otomo firmly believed that, as the overseers of the Imperial Bureaucracy, the Emperor depended upon them and that they must always be close at hand. Some among the Great Clans believe that the bureaucracy serves the Otomo rather than the other way around, but few would ever dare to speak so to the members of an Imperial family, at least when an Emperor sits upon throne. During times of a vacant throne, however, the Otomo generally keep a lower profile and try to avoid drawing the ire of the clans. Following the destruction of Otosan Uchi, the Otomo family&rsquo;s estate was burned to the ground along with many of their holdings. Their allies among the Crane constructed a new estate for them within the Crane lands, where it remains despite that the family has relocated many of its major functions to a new estate within the new Imperial City, Toshi Ranbo.</p>"
    }
  },
  {
    "id" : "I9",
    "name" : "Kyuden Seppun",
    "type" : "castle",
    "pos" : [336.138671875, 207.23291015625],
    "lblPos" : null,
    "provinceId" : "Imperial-2",
    "owner" : "imperial",
    "details": {
      "html" : "<p>The ancestral estate of the Seppun family is located a short distance south of Otosan Uchi, close enough that the city is visible in the distance and vice versa. It is from the castle that the family organizes and supervises the execution of its duties as the protectors of the throne. Despite the thousand years of diligence in protecting the Hantei Dynasty, the Seppun family&rsquo;s failure to protect the lives of the Toturi Emperors weighs heavily upon them, and the atmosphere of Kyuden Seppun is often somber as a result. Since the relocation of the Imperial City, the estate is no longer conveniently situated near the personage of the Emperor. Although the family has moved many of its essential functions to Toshi Ranbo, they have not forsaken their ancestral estate. The family&rsquo;s strong sense of duty makes such a thing virtually impossible, and even if it was their wish to do so, Kyuden Seppun is considered by the Brotherhood of Shinsei one of the holiest sites in the Empire of Rokugan, and is unlikely to be abandoned under any but the most dire of circumstances.</p>"
    }
  },
  {
    "id" : "I10",
    "name" : "Nirukti",
    "type" : "city",
    "pos" : [142.5490264892578, 363.5294189453125],
    "lblPos" : null,
    "provinceId" : "Crab-6",
    "details": {
      "html" : "<h3>City of Joy</h3> <p>The City of Joy is the ancestral city of the Greensnake bloodline of the Naga race. Among all the Naga cities, it endured the Great Sleep with the least amount of damage suffered, a testament perhaps to the adaptability and perseverance of the Greensnake people. The Greensnakes are the scouts and ambassadors of the Naga, and vastly better suited to interact in the world of men than any of their fellow serpent men, even the hardy and militant Asps. More of the Greensnake bloodline survived the sleep than any other bloodline, and even though the vast majority of them have returned to sleep, a few remain awake to assist their Asp cousins with overseeing the Naga during their slumber. Ironically, despite the city&rsquo;s generally intact state, samurai never enter it because of a long-standing Imperial edict that prohibits any Rokugani from entering it. Although this edict was issued during the reign of Hantei XI shortly after scouts discovered the city within the Shinomen Mori, it was never countermanded by succeeding Emperors, and thus even the Naga&rsquo;s allies among the Crab and Unicorn have declined to enter.</p>"
    }
  },
  {
    "id" : "I11",
    "name" : "Otosan Iuchi",
    "type" : "city",
    "pos" : [331.824951171875, 189.97801208496094],
    "lblPos" : null,
    "provinceId" : "Imperial-2",
    "owner" : "imperial",
    "details": {
      "html" : "<p>Founded at the dawn of the Empire, Otosan Uchi served as the home of the first Hantei Emperor, and was the Imperial City for the entirety of the Hantei Dynasty that ruled over Rokugan for more than one thousand years. For the first few centuries, the city expanded rapidly, but its growth slowed eventually, never actually stopping but holding relatively stable as time went on. Unfortunately the coastal region in which the city was built is among the Empire&rsquo;s unstable in terms of the frequent, lowgrade earthquakes that plague the area throughout portions of the year. As a result, many structures are constantly damaged by the quakes and exist in a state of near constant repair. Some of the outermost portions of the city, including the low stone wall that surrounds it, are never fully repaired and mar the image of the city as the most grandiose in the Empire with their terrible condition. The innermost regions of the city are vastly more stable, however, owing to their superior construction. In fact, there is a sort of second city within the city, forbidden to all those who do not live within or possess an invitation. This &ldquo;forbidden city&rdquo; is dominated by the Imperial Palace, the embassies of the Great Clans, and some of the most ancient and revered temples in all of Rokugan.</p>"
    }
  },
  {
    "id" : "I12",
    "name" : "Pleasure City",
    "type" : "city",
    "pos" : [185.686279296875, 353.7254943847656],
    "lblPos" : null,
    "provinceId" : "Scorpion-4",
    "details": {
      "html" : "<h3>Zakyo Toshi</h3> <p>The city known as Zakyo Toshi is a testament to five centuries of vice and debauchery. The city&rsquo;s founding and its original purpose are largely unknown and unimportant, as those who dwell within the city find little purpose for things such as record-keeping or sentimentality. For a city of such size to have developed in unaligned lands would surely have required significant financial backing, but who may have been responsible for such a thing remains unknown. Over the centuries since its creation, Pleasure City has become known throughout the Empire for the diversity and quality of its vices, including gambling, drinking, geisha houses of ill repute, and any number of other questionable opportunities for visitors. The city occupies some strategic importance, situated as it is on the border between the Scorpion lands and the lands of the Three Man Alliance, a cooperative alliance between the Fox, Sparrow, and Wasp Minor Clans. It was for this reason that the Scorpion, under the command of a Scorpion Emerald Champion, annexed the city during the twelfth century. Prior to that, the city was almost lawless despite the efforts of a limited number of Imperial troops constantly struggling to curb the worst of the city&rsquo;s excesses.</p>"
    }
  },
  {
    "id" : "I13",
    "name" : "Reihado Shinsei",
    "type" : "shrine",
    "pos" : [333.92156982421875, 226.66664123535156],
    "lblPos" : null,
    "provinceId" : "Imperial-3",
    "owner" : "imperial",
    "details": {
      "html" : "<p>The crow is a creature of great symbolic value in Rokugan, as it is associated with the Little Prophet, Shinsei. It is said that a crow accompanied Shinsei and the Seven Thunders into the Shadowlands prior to the first Day of Thunder more than a thousand years ago, and that up until that point it had brilliant white plumage. Traveling through the Shadowlands, and the forces that Shinsei and the Thunders encountered, caused the bird&rsquo;s feathers to turn black, and its sacrifice is remember by all who see it. Who constructed the Shrine to Shinsei is unknown, as is so much about the Little Prophet, but it is said that it is maintained by the kenku, the strange crow-men who revere him. The shrine&rsquo;s exact location is a mystery as well, and even those few who have managed to locate it cannot describe its location to others, but must lead them there. Legend holds that only those who are pure of heart and spirit can find the shrine.</p>"
    }
  },
  {
    "id" : "I14",
    "name" : "Siska",
    "type" : "city",
    "pos" : [129.21568298339844, 343.5294189453125],
    "lblPos" : null,
    "provinceId" : "Shinomen-1",
    "details": {
      "html" : "<h3>City of Courage</h3> <p>Also known as the City of Courage, Siska is the ancestral city that is the homeland of the Asp bloodline of the Naga people. As the warriors and defenders of the Naga race, the Asp have more in common with the samurai of Rokugan than perhaps any other of their brethren, but this does not mean that they are particularly similar. Of the four large Naga cities that endured the Great Sleep, Siska is by far the least damaged city in which the Rokugan have ventured. It endured the ravages of time particularly well, although some degradation of structures and its populace was naturally unavoidable. As warriors, the Asp were perhaps better suited for the Sleep, having made preparations for their awakening with the expectation that they would be entering a great war in the process. It is for perhaps this reason that the city endured so well, although that cannot be known for certain. Since the Naga returned to the Great Sleep, the Asp city is one of two, along with the Cobra bloodline&rsquo;s city, that sees regular traffic from humans, and is frequently visited by the handful of Naga who remain awake in the Empire.</p>"
    }
  },
  {
    "id" : "I15",
    "name" : "Temple of Osano-Wo",
    "type" : "temple",
    "pos" : [129.21568298339844, 288.23529052734375],
    "lblPos" : null,
    "provinceId" : "Shinomen-1",
    "details": {
      "html" : "<p>The largest and most prominent temple devoted to the Fortune of Fire &amp; Thunder in the Empire, the Temple of Osano-Wo is located south of Otosan Uchi, near the Crane coastline. The monks who adhere to the strictures of Osano-Wo are a particularly militant and combative group, prone to displays of strength and temper to rival that of the Fortune they revere. Osano-Wo is a particularly important figure in Rokugani&rsquo;s cosmology because he was among the first great mortal heroes to be elevated to the divine. For that reason, in addition to the litany of great deeds Hida Osano-Wo performed prior to his mortal death, he is revered by heroes and warriors throughout the Empire. This ensures that his great temple sees a steady stream of pilgrims, a fact that seems to annoy his monks more than anything else. Thunderstorms are nearly constant in the area, coming at least once during the average day and ensuring that the rocky and difficult terrain is nevertheless plagued with lush overgrowth, rendering travel through the area even more difficult.</p>"
    }
  },
  {
    "id" : "I16",
    "name" : "Toshi Ranbo",
    "type" : "city",
    "pos" : [289.60784912109375, 201.17645263671875],
    "lblPos" : null,
    "provinceId" : "Lion-5",
    "details": {
      "html" : "<h3>Violence Behind Courtliness City</h3><p>For most of its history, Toshi Ranbo wo Shien Shite Reigisaho, also known as Violence Behind Courtliness City, has been a flashpoint of conflict between the Lion and Crane, upon whose shared border the city rests. The city has changed hands countless times between the two clans, each bloodier and more costly than the last, but the city&rsquo;s possession has often been a matter of honor. Both the Lion and the Crane have historical records that indicate they are the rightful administrators of the city, and no arbitration or mediation has ever been able to determine which account is correct. Countless heroes have been made and died in the sacking or defense of the city, and it is littered with shrines to the thousands who have died within its confines. After the destruction of Otosan Uchi at the hands of the Shadowlands, a rare moment of cooperation between the Lion and Crane Champions resulted in Toshi Ranbo becoming the new Imperial City. It was host to the reign of Emperor Toturi III, the final Emperor of the Toturi Dynasty, as well as home to the dawn of the Iweko Dynasty shortly thereafter. Following the city&rsquo;s appointment, massive construction began to accommodate the presence of the Imperial families and the many private estates and embassies that sprung up around it, doubling the city&rsquo;s size almost overnight. It is now one of the largest cities in the Empire, rivaled only by Ryoko Owari and the sprawling port city surrounding Kyuden Gotei.</p>"
    }
  },
  {
    "id" : "I17",
    "name" : "Vyakarana",
    "type" : "city",
    "pos" : [98.23529052734375, 267.0588073730469],
    "lblPos" : null,
    "provinceId" : "Shinomen-1",
    "details": {
      "html" : "<h3>City of Magic</h3> <p>The City of Magic is home to the Cobra bloodline of the Naga race, and is a source of great mystery and confusion even to the other serpent men. When the Naga emerged from the Great Sleep, the Cobra did so in noticeably smaller numbers than the other bloodlines (save of course for the doomed Constrictors), and soon discovered that their city was covered in thick webs of an unknown origin. Many of the sleeping Cobra had perished, and as of yet the Naga and their allies have no idea why this has happened or what might be responsible for such a thing. Because the people of Rokugan are prohibited from entering the city of Nirukti by a standing Imperial edict, the Naga&rsquo;s allies among the Unicorn have made Vyakarana the center for their operations within the Shinomen Mori, and use this as the point of contact between them and the few Naga people who remain awake.</p>"
    }
  },
  {
    "id" : "MC1",
    "name" : "Kudo",
    "type" : "village",
    "pos" : [192.35293579101562, 376.86273193359375],
    "lblPos" : null,
    "provinceId" : "Scorpion-6",
    "owner" : "none",
    "details": {
      "html" : "<p>Kudo is a large village that, despite its simplicity, is something of a flashpoint not only for its owner the Hare Clan but for the entire Minor Clan Alliance as well. Although not as fertile as Koeru Mura, Kudo is nevertheless one of the most productive holdings among those controlled by the Minor Clans. It generates the vast majority of the food used each year by the Hare Clan, and there is frequently a small but appreciable surplus, which the Hare often share with their allies in the Minor Clan Alliance. Additionally, in modern times the Hare have granted holdings within the village to the Alliance, which maintains barracks and dojo within its confines. The single legion the Alliance controls can be housed entirely within the village at one time, though that has never actually been the case. The fertility of the land and the presence of adequate if not exceptional training facilities make the village an attractive target, unfortunately, and during the tumultuous period at the end of the Toturi Dynasty the village is forcibly annexed by the Lion Clan. Although the annexation is brief in duration, it has a long-lasting effect of souring relations between the Hare and Lion, who had been frequent allies prior to the incident. </p> "
    }
  },
  {
    "id" : "MC2",
    "name" : "Kyuden Komori",
    "type" : "city",
    "pos" : [340.1960754394531, 551.37255859375],
    "lblPos" : null,
    "provinceId" : "Mantis-5",
    "owner" : "none",
    "details": {
      "html" : "<p>The tiny Bat Clan is likely the smallest of all modern Minor Clans and, if one includes the history of the Tsi ronin family before they became the Oriole Clan, the Bat are the youngest such clan as well. The castle that houses the entire clan is constructed on a tiny island previously known simply as the Island of Lost Wilderness. It was a Mantis holding, but at the time of the Bat's formation the Mantis Clan Champion presented the island to the Bat Clan's founder as a gift. The island had never been developed due to its small size and relative scarcity of resources. Lord Komori was determined to make it a viable home for his new clan, however, and with the generosity of the Yoritomo family he was successful in constructing a large estate and small village. The lands and nearby seafood have been just enough to sustain the clan in the years since its founding.</p> <p>The estate hosts the entirety of the Bat Clan, and also has room for a small number of guests, although to date they have had none save from the Mantis Clan and the Minor Clan Alliance. The village around the estate is filled with idealistic peasants, generally younger couples and their children, who flocked to the island at the Bat Clan's founding. They sought the opportunity to be part of something greater than themselves, and hopefully to earn the magnanimity of their new lords in the process.</p>"
    }
  },
  {
    "id" : "MC3",
    "name" : "Kyuden Kasuga",
    "type" : "city",
    "pos" : [342.4131774902344, 194.68389892578125],
    "lblPos" : null,
    "provinceId" : "Imperial-2",
    "owner" : "none",
    "details": {
      "html" : "<p>There are many castles and palaces in the Empire that have strange architectural details, particularly in the Mantis and Unicorn clans, but none that are more strange in appearance than the complete oddity that is Kyuden Kasuga. The castle is deliberately built to resemble a tortoise shell, making it perhaps the strangest-looking building in all of Rokugan.</p> <p>The formal estate of the Tortoise Clan is constructed on the peninsula leading into the bay of Otosan Uchi, for centuries the Imperial City and largest city in the Empire of Rokugan. The Tortoise used the Imperial city as their base of operations since their clan was created, and have never controlled significant holdings outside of its boundaries. Kyuden Kasuga was created only after the Tortoise were finally awarded a formal family name, and is not only the center for their clan's operations but also an important location for the Minor Clan Alliance, of which the Tortoise are active members. The castle contains numerous court chambers, ensuring that a number of different courts (or more likely trade negotiations) can be conducted simultaneously without any participants knowing what is taking place in adjoining chambers. Naturally the Tortoise themselves have areas that allow them to overhear multiple chambers simultaneously if they feel the need.</p>"
    }
  },
  {
    "id" : "MC4",
    "name" : "Kyuden Suzume",
    "type" : "castle",
    "pos" : [174.31370544433594, 463.5294189453125],
    "lblPos" : null,
    "provinceId" : "Crab-2",
    "owner" : "none",
    "details": {
      "html" : "<p>This castle is not the only Minor Clan holding to bear the appellation Kyuden, which normally implies the estate in question is large enough to host the Emperor's court, but Kyuden Suzume is the only estate in the Minor Clans which can actually claim the honor of possessing such physical size. The Sparrow have never hosted the Imperial Winter Court, of course, and have no particular desire to do so, but they take some small degree of pride in the fact that they theoretically could. Ironically, no one who ever looked upon the castle would ever imagine its true size, since from the exterior it seems quite meager and rather underwhelming. The castle's true capacity can only be appreciated when one experiences the surprising array of tunnels beneath it, extending in every direction for hundreds of yards. These tunnels and warrens are actually well appointed, at least in terms of the impoverished Sparrow Clan's meager resources, but of course the Suzume would never presume to host guests beneath the surface of the earth. Thus, it is likely that no court of any significance will ever be held within the castle's confines.</p>"
    }
  },
  {
    "id" : "MC5",
    "name" : "Kyuden Tonbo",
    "type" : "city",
    "pos" : [200.56861877441406, 120.21568298339844],
    "lblPos" : null,
    "provinceId" : "Dragon-5",
    "owner" : "none",
    "details": {
      "html" : "<p>The ancestral estate of the Dragonfly Clan is situated very near the Lion Clan's borders. This would perhaps not be an issue at all save for the circumstances surrounding the birth of the Dragonfly Clan, which included a grave offense to the Lion. The Lion are hardly known for forgiving such things  indeed they are reputed to be some of the greatest grudgeholders in Rokugan. On at least three different occasions the Lion have nearly devastated the entire Dragonfly province, but each time the resilient Tonbo have rebuilt, and each time Kyuden Tonbo has become greater for it. (Ironically, on one occasion the Lion vigorously defended the palace from Yobanjin raiders to the north, on the principle that the defense of the Empire was a matter of greater honor than any feud with the Tonbo.) In modern times, Kyuden Tonbo's estate centers on a cylindrical tower, eight stories or more in height, visible for miles around.</p><p>Because of the damage the Dragonfly lands have suffered regularly during the centuries since their founding, there are few temples and shrines of note within the Tonbo lands. Most sites of religious importance are located within the palace itself, and as a result there are a great many visitors to Kyuden Tonbo on a daily basis. Some among the Dragonfly's allies have cited this practice as dangerous, since it dramatically complicates attempts at security, but the Tonbo family leaders feel it is important for their people to live without fear that their ancestral shrines will be destroyed by any future invasion of their homelands.</p>"
    }
  },
  {
    "id" : "MC6",
    "name" : "Meidochi",
    "type" : "village",
    "pos" : [164.90196228027344, 338.8235168457031],
    "lblPos" : null,
    "provinceId" : "Crab-7",
    "owner" : "none",
    "details": {
      "html" : "<p>The village of Meidochi is a minor holding in the most remote region of the Hare lands. It is out of the way of virtually everything, and the only road leading to it was specifically built in order to collect taxes from the village. It is, for all intents and purposes, completely isolated. The village is able to sustain itself and meet its taxes for both clan and Empire, but has little else in the way of resources. In fact, it was something of a problem for the Hare until the creation of the Ujina family, who accepted the village as their primary holding within the clan's single province. The Ujina founder sent the Usagi troops stationed in the village away, greatly reducing Meidochi's cost to the clan. When bandits attacked shortly thereafter, the ten Ujina samurai who lived there slaughtered more than twice their number of bandits while suffering no losses. Today every bandit in the Empire is afraid of the village, and Meidochi has become somewhat more profitable for the Hare, thanks to the fanatical loyalty most in the village feel for their Ujina lords. There is little of note within the village save for the Ujina dojo, which is only slightly larger than the peasant buildings. There is a quiet aura of menace within the village, however, since the disturbing nature of the Ujina family seems to some extent to affect even the villagers loyal to them.</p>"
    }
  },
  {
    "id" : "MC7",
    "name" : "Shiro Chuda",
    "type" : "temple",
    "pos" : [290, 93.33333587646484],
    "lblPos" : null,
    "provinceId" : "Phoenix-4",
    "owner" : "none",
    "details": {
      "html" : "<p>The Snake Clan was founded by one of the Empire's most decorated Emerald Magistrates, and he built a grand new temple in the middle of the Dragon Heart Plain. This location suited a number of purposes. For one, it was close to Isawa Chuda's homeland within the Phoenix provinces. For another, the Dragon Heart Plain was one of the largest unclaimed territories within the Empire, and as a result was often the site of activity by those who did not wish to be found, such as the maho-tsukai Chuda and his newly formed family had vowed to hunt to the ends of the earth.</p> <p>Sadly, Chuda married for love rather than duty, and his beloved wife simply was unable to resist the temptations Chuda himself brushed aside so easily. The Chuda family fell into maho use and within a generation was utterly corrupt. When the Phoenix discovered this, they purged the small Minor Clan from the face of the mortal realm, an uncharacteristic display of military might that gave many in the Empire pause. The ruins of their ancestral estate remain undisturbed on the Dragon Heart Plain, and occasionally things not of this world emerge from them. Some have championed the notion of destroying the ruins once and for all, but others argue that doing so could unleash something completely unforeseen and visit terrible devastation throughout the northern Empire. The debate continues with no end in sight.</p>"
    }
  },
  {
    "id" : "MC8",
    "name" : "Shiro Heichi",
    "type" : "generic",
    "pos" : [53.92156982421875, 322.3529357910156],
    "lblPos" : null,
    "provinceId" : "Spider-1",
    "owner" : "none",
    "details": {
      "html" : "<p>Deep within the Twilight Mountains lie the ruins of Shiro Heichi, seat of a Minor Clan purged utterly from the face of the earth by a combination of treachery and time. The clan's origins lie in a group of Crab sent in to mine a particularly fruitful valley in the mountains. They had been there some months when a terrible rockslide cut off all points of entry into the valley. The Crab attempted to clear the path, but this only caused more rockslides, and eventually they decided the valley was too unsafe to proceed. Decades later, a massive earthquake in the region opened the valley again, and a group of samurai emerged carrying a massive quantity of jade and ore. They did not speak the Crab who attempted to engage them, but traveled directly to the Imperial City, where they offered the minerals to the Emperor as taxes owed from the years spent isolated within his valley. The Emperor, greatly pleased, decreed the former Crab to be the Heichi family of the new Boar Clan.</p> <p>Tragically, the clan existed for only slightly more than half a century before they were betrayed by a guest, an individual known only as Agasha Ryuden. He took from the valley ore created by the fallen blood of the First Oni and created the Anvil of Despair, one of the most accursed artifacts in all history. It was forged using the souls of the entire Heichi family. Since that day, samurai have occasionally claimed direct descent from the Heichi, but these claims have never been proven. Eventually an Imperial edict formally rendered the Heichi family, and with it the Boar Clan, extinct.</p>"
    }
  },
  {
    "id" : "MC9",
    "name" : "Shiro Heichi",
    "type" : "castle",
    "pos" : [47.25490188598633, 33.72549057006836],
    "lblPos" : null,
    "provinceId" : "Northlands-1",
    "owner" : "none",
    "details": {
      "html" : "<p>Easily the most beleaguered Minor Clan stronghold by any estimation, Shiro Ichiro was created a few centuries after the dawn of the Empire, ostensibly to guard the northern passes from potential incursions by Yobanjin raiders and other gaijin on the steppes. Although most Badger Clan samurai truly believed this was their role, in truth it was only a faade for the clan's real purpose. This was to guard a secret shrine that marked the grave of Ryoshun, the tenth Kami that mortals never knew. The secret was known only to a handful of the first Badger samurai, and within a few generations, the knowledge was lost to the clan entirely; an unfortunate series of accidents ensured the secret was never passed on.</p> <p>The Badger have never been the most populous Minor Clan, and have little in the way of holdings. The vast majority of the locations under their control are patterned after Shiro Ichiro itself: mountain fortresses that sit atop virtually unassailable plateaus. The clan's vassals vigorously mine the mountains for any valuable resource they can find, and use the majority of the yield to trade for the clan's food from their neighbors to the south, the Unicorn. The castle can be reached by a number of small paths that lead up to the plateau, all of which can be quickly and easily collapsed to obstruct invaders. Unfortunately, due to the necessity of trading for their food, the Badger are quite vulnerable to long term sieges, and if such a situation were to arise, even the clan's ancestral estate would only be able to hold out for two or three months at the very most. However, there are a small number of secret escape tunnels leading away from the castle, primarily using mines that are no longer in use.</p>"
    }
  },
  {
    "id" : "MC10",
    "name" : "Shiro Morito",
    "type" : "castle",
    "pos" : [271.17645263671875, 52.156864166259766],
    "lblPos" : null,
    "provinceId" : "Phoenix-1",
    "owner" : "none",
    "details": {
      "html" : "<p>The foreboding fortress of the Ox Clan is one of the most militant holdings along the Empire's northern border, even taking into account the neighboring lands of the Dragon and Phoenix. Although those Great Clans command vastly superior resources and military forces, they are also among the more peaceful of the Emperor's servants, whereas the Ox are among the most warlike. Shiro Morito is a fortress, and none would ever make the mistake of considering it a palace or even a castle, although for simplicity's sake the latter title is normally applied. It is perhaps the largest military installation under the control of a Minor Clan anywhere in the Empire. Many find it very strange that a Minor Clan would defend itself so fiercely, but assume it is because the clan is situated close to the Great Wall of the North and might have to fend off attacks from Yobanjin raiders from outside Rokugan's northern border. While this is true to some extent, in truth the founder of the Ox Clan was actually a high-ranking member of the subversive Kolat conspiracy, and built the fortress in its current location as a means of defending the conspiracy's secret headquarters, hidden in the mountains behind.</p> <p>Shiro Morito does contain a court chamber, which is used quite infrequently, as well as a large dojo and what is likely the largest stable in the Empire outside the Unicorn Clan provinces.</p>"
    }
  },
  {
    "id" : "MC11",
    "name" : "Shiro Usagi",
    "type" : "castle",
    "pos" : [131.96078491210938, 206.2744903564453],
    "lblPos" : null,
    "provinceId" : "Phoenix-1",
    "owner" : "none",
    "details": {
      "html" : "<p>The ancestral estate of the Hare Clan was first constructed when the clan was founded centuries ago. The ronin Reichin had offered vital assistance in a battle with the Bloodspeaker Iuchiban, and as reward was allowed to found his own Minor Clan. Reichin and the other ronin who joined the nascent Hare Clan were well regarded by the Empire, and they enjoyed good fortune for many generations. That would not last, unfortunately, as the Hare's investigative nature and tendency to stick their noses in where they did not belong attracted the ire not only of the Bloodspeakers, but eventually of the Kolat and the Scorpion Clan as well. False allegations of maho use, planted by Kolat agents, resulted in the clan's temporary dissolution and the destruction of Shiro Usagi itself, but they were eventually reinstated and the castle rebuilt. The loss had a significant effect upon the clan, however, and the rebuilt Shiro Usagi is larger and vastly more fortified than it was before. In a fit of irony, the castle contains numerous secret passages and chambers known only to the highest echelon of Usagi samurai, much like the castles of the Scorpion. These tunnels allow the Hare to move secretly and avoid potential compromise at the hands of enemies, enemies the Usagi tend to see around every corner even if they are actually encountered rarely at best.</p>"
    }
  },
  {
    "id" : "MC12",
    "name" : "Tanuki Grove",
    "type" : "generic",
    "pos" : [85.68627166748047, 226.2744903564453],
    "lblPos" : null,
    "provinceId" : "Spider-2",
    "owner" : "none",
    "details": {
      "html" : "<p>At some point during the Empire's history, a Badger Clan samurai was lost within the depths of the Shinomen Mori for more than a year. The man emerged with no sense of the time he had lost, but experienced terrifying dreams of strange spirits, the likes of which no one had ever encountered. The Emperor of that era was a scholarly man with an interest in the spirit realms, and had the Badger brought before him for several days to learn all he could about what the man had seen. At the conclusion of their discussions, the Emperor declared the samurai to be the lord of a new Minor Clan, which the Badger named the Tanuki Clan in honor of his parent clan. Their duty was to delve into the mysteries of the Shinomen. The clan dwelled within a small grove of trees on the outskirts of the forest, and submitted regular reports to the Imperial City as mandated by their charter. The Emperor who created the clan died shortly thereafter, however. His heir found the Tanuki absurd but amusing, and read their reports to the Imperial Court as a form of entertainment. In the generation after that, the new Emperor sought to dissolve the clan and erase what he saw as an embarrassment to his grandfather's name  but when Imperial agents arrived at Tanuki Grove, they found nothing. No trace of the samurai of the Tanuki Clan was ever found, and their names were stricken from many records, rediscovered centuries later purely by accident.</p>"
    }
  },
  {
    "id" : "MC13",
    "name" : "Toku Torid-e",
    "type" : "tower",
    "pos" : [242.94117736816406, 252.94114685058594],
    "lblPos" : null,
    "provinceId" : "Scorpion-3",
    "owner" : "none",
    "details": {
      "html" : "<p>The Vigilant Keep of the Monkey is the principle holding of the Monkey Clan, called by some the favored vassals of the Toturi Dynasty. Within decades of the clan's formation, the keep was nearly destroyed on two separate occasions, but each time ample funds were made available by the Imperial families to facilitate its reconstruction. Although by no means as impressive as the fortifications of the Great Clans, or even some of the more militant Minor Clans, Toku Torid-e is a soundly and strategically constructed castle, better built than many of its size thanks to its Imperial funding. It is the site of one of only three major Monkey Clan dojo, and the largest dojo the clan maintains. It is also home to the Empire's largest shrine to Toku, the Fortune of Virtue and the founder of the Monkey Clan. The Toku have also built individual shrines devoted to each Emperor of the short-lived Toturi Dynasty, for Toku himself was a close friend and ally to the dynasty's founder and his descendents continue to hold the Toturi in the highest regard.</p>"
    }
  },
  {
    "id" : "SH1",
    "name" : "Big Stink",
    "type" : "castle",
    "pos" : [134.7058868408203, 553.3333129882812],
    "lblPos" : null,
    "provinceId" : "Shadowlands-1",
    "owner" : "shadowlands",
    "details": {
      "html" : "<h3>Kappa</h3> <p>Once known simply as Kappa, Big Stink was originally a Crab fortress under the control of the Hiruma family. When the Hiruma lands were lost to the Shadowlands during the eighth century, Kappa was overrun and believed destroyed. Because of its relative unimportance compared to Shiro Hiruma, no significant effort was made to recapture Kappa. In the absence of samurai to maintain it, Kappa became a city of goblins. Various tribes of the insidious little creatures have infested the ruined city, turning it into a mockery of its former glory. The creatures engage in what passes for diplomacy and commerce there, haggling over food and objects of highly questionable value, and even fighting one another for the affection of females. The Kuni family is aware of the existence of Big Stink, and has on occasion conducted negotiations with the goblins for one reason or another, but they have not revealed its existence to the rest of the Crab Clan, who would doubtless destroy it immediately.</p>"
    }
  },
  {
    "id" : "SH2",
    "name" : "City of the Lost",
    "type" : "city",
    "pos" : [65.68627166748047, 563.1372680664062],
    "lblPos" : null,
    "provinceId" : "Shadowlands-2",
    "owner" : "shadowlands",
    "details": {
      "html" : "<p>The crowning achievement of the Shadowlands and of the Lost, even before they called themselves the Spider Clan, is surely the City of the Lost. Constructed at the command of Daigotsu, the Dark Lord of the Shadowlands, the City of the Lost is a dark reflection of the Empire of Rokugan, a vast experiment to bring order to the previously chaotic forces of the Lost within the Shadowlands. Under Daigotsu&rsquo;s tutelage, the diverse members of the Lost learned to overcome their own petty hostilities and work together, not only to build a vast city, but to combine their prowess against their common enemy: Rokugan. Built using the unholy power of a legion of maho-tsukai and the incredible physical power of creatures like oni, ogres, and trolls, the City of the Lost rivals the largest cities of the Empire in sheer size. It has all manner of training grounds where large units of bushi practice maneuvers, massive (and blasphemous) temples to the Ninth Kami for maho-tsukai to practice their dark arts. The city even has mundane things like tea and sake houses, although the wares they serve are unlike anything ever seen within the Empire (and thankfully so). In a continuing parallel of Rokugan, the City of the Lost is protected by a Wall of Bone in a manner similar to the Great Carpenter Wall&rsquo;s defense of the Empire.</p>"
    }
  },
  {
    "id" : "SH3",
    "name" : "Festering Pit of Fu Leng",
    "type" : "generic",
    "pos" : [30.39215660095215, 570.1961059570312],
    "lblPos" : null,
    "provinceId" : "Shadowlands-2",
    "owner" : "shadowlands",
    "details": {
      "html" : "<p>It is said no mortal has ever laid eyes upon the Festering Pit of Fu Leng, but none can question that it exists. The only firsthand accounts of its existence are available to the Crab from their allies among the Nezumi tribes, the rat-men who are immune to the effects of the Shadowlands Taint and thus can travel farther into its depths than any human. The Pit was created at the dawn of the Empire, when the divine form of Fu Leng, child of Lady Sun and Lord Moon, plummeted to the earth after the epic battle between his brother, Hantei, and Lord Moon. For reasons no one can know, Fu Leng fell along a different path and landed far, far away from his siblings. When he struck the earth, he plunged through it into Jigoku, the Realm of Evil, where the malevolent presence of that sinister place corrupted him and created the ultimate minion of evil. While Fu Leng&rsquo;s war against the Empire has waxed and waned over the centuries, the Pit has never closed, allowing all manner of vile and twisted creatures to crawl forth and populate the Shadowlands. The Kuni family of the Crab theorize it is the existence of the Pit that allows the Shadowlands itself to continue to exist and that, were it ever closed, the Taint and the Shadowlands would cease to spread. Unfortunately, no one has any idea how a task such as sealing the Pit could ever be accomplished.</p>"
    }
  },
  {
    "id" : "SH4",
    "name" : "Fields of the Dead",
    "type" : "generic",
    "pos" : [343.5896301269531, 153.8995819091797],
    "lblPos" : null,
    "provinceId" : "Phoenix-5",
    "owner" : "spider",
    "details": {
      "html" : "<p>The Spider excel at locating forgotten corners of the Empire in which to weave their webs, and the Fields of the Dead are a perfect example of such industriousness. Centuries ago, the Emperor issued an edict mandating cremation as the means of disposing of human remains. Prior to that the Rokugani had buried their dead, but the battle with the Bloodspeaker Iuchiban in the Imperial City changed that. Neither the Emperor nor his subjects desired to see their ancestors re-animated and used as shock troops for a blood sorcerer. The region now called the Fields of the Dead was an old graveyard, long since filled to capacity, concealed among the craggy cliffs on an uninhabitable region of coastline north of Otosan Uchi. There were none to pay homage to the shrines there, as the entire graveyard was filled with the bodies of those washed upon shore, victims of pirates and shipwrecks, most of whom were completely unidentifiable and were only buried out of basic respect &ndash; not to mention the fear of angering both Emma-O and Suitengu, the Fortunes of Death and the Sea, respectively. While portions of the graveyard have been utilized by enterprising maho-tsukai over the centuries, the majority of it remains intact and undisturbed, at least until the Spider located it and co-opted it for their use. After that it became a center for the Chuda family to perfect their sacrilegious necromantic arts, and a constant source of undead forces for the Dark Lord to use as he willed.</p>"
    }
  },
  {
    "id" : "SH5",
    "name" : "Fingers of Bone",
    "type" : "generic",
    "pos" : [85.29412078857422, 33.72549057006836],
    "lblPos" : null,
    "provinceId" : "Northlands-2",
    "owner" : "shadowlands",
    "details": {
      "html" : "<p>North of Rokugan, high in the unexplored regions of the Great Wall of the North Mountains, there exists a field of strange rock spires unlike anything ever seen within the Empire. In the first days of history, there were tribes of Rokugani who sought shelter among these spires, constructing crude shelters around their bases and even within some of the larger and stronger spires. These shelters were forgotten with the coming of the Kami, however, as the people of Rokugan either flocked south to join the newborn Empire or fled east to the steppes, where they would become the Yobanjin tribes. The Fingers, as they were called at the time, were forgotten, and remained so for hundreds of years. They were rediscovered purely by accident when agents of the Dark Lord of the Shadowlands stumbled across them while traveling back from the Burning Sands, where they had delivered a message for their lord. When the Dark Lord discovered the Fingers&rsquo; existence, he immediately dispatched a small force to assess and occupy them, hoping to use them as a staging point for attacks against the Empire. Since that time, the Fingers have proven remarkably useful, as their natural geography makes discovery exceptionally unlikely, and the Spider Clan&rsquo;s abilities allow them to hollow out the spires without compromising their integrity. A large portion of the entire Spider Clan can be housed within the Fingers of Bone, as they have renamed the formation, without much difficulty.</p>"
    }
  },
  {
    "id" : "SH6",
    "name" : "Forgotten Tomb of Fu Leng",
    "type" : "shrine",
    "pos" : [47.64706039428711, 539.2156982421875],
    "lblPos" : null,
    "provinceId" : "Shadowlands-2",
    "owner" : "shadowlands",
    "details": {
      "html" : "<p>This massive, mysterious edifice exists deep within the Shadowlands, farther south than is safe for regular travel even by the hardiest of the Crab Clan&rsquo;s scouts. It is believed this is where the remains of Fu Leng were interred after his defeat by the Seven Thunders, although by whom no one knows for certain. The architecture is completely alien to Rokugani sensibilities, and the few Crab who have ventured far enough to look upon the Tomb report it resonates a truly horrific evil. Even the twisted plants of the Shadowlands do not grow in a wide radius around the structure. So far as the Crab are aware, none who have entered the building have ever emerged again. What they do not know is that within, the boundaries between the mortal realm and Jigoku, the Realm of Evil, do not exist. The most horrible, nightmarish oni to be found in that sinister realm, even those who are unable to cross the boundaries into the mortal world, can affect anything or anyone that enters the tomb, ensuring that it is without question one of the deadliest locations in existence. On one occasion, when the demon master known as the Shokansuru entered the Tomb, he was able to completely transfer some of the most powerful demons the Empire has even seen into the mortal realm by reaching through the boundary and merging the creatures with mortal souls. Doing so created oni of nigh unimaginable power, but also fully incarnated them in the mortal realm, leaving them vulnerable to final death if destroyed.</p>"
    }
  },
  {
    "id" : "SH7",
    "name" : "Shadowed Dojo",
    "type" : "temple",
    "pos" : [29.60784339904785, 412.01959228515625],
    "lblPos" : null,
    "provinceId" : "Shadowlands-4",
    "owner" : "shadowlands",
    "details": {
      "html" : "<p>The temple known as the Shadowed Dojo is the greatest temple of the Order of the Spider, the renegade sect from the Brotherhood of Shinsei that serves the Spider Clan. The order&rsquo;s founder, the insane monk Roshungi, spent a decade carefully removing all mention of the dojo&rsquo;s location from Brotherhood records, while likewise carefully culling the Brotherhood&rsquo;s ranks of all who knew of its location. Those stationed at the temple itself were very slowly won over by Roshungi&rsquo;s particular brand of charismatic madness, and formed the core of the Order of the Spider. Once Roshungi&rsquo;s agenda was complete, the Shadowed Dojo was truly born. Situated deep within one of the few forested regions in the Twilight Mountains, the dojo is secluded from all outside influences, ensuring those who are brought to study there have no recourse but to embrace the dark philosophy and rigid conditioning offered at the temple.</p>"
    }
  },
  {
    "id" : "SH8",
    "name" : "Marsh of the Shinomen",
    "type" : "generic",
    "pos" : [119.01960754394531, 328.23529052734375],
    "lblPos" : null,
    "provinceId" : "Shinomen-1",
    "owner" : "spider",
    "details": {
      "html" : "<p>At some point during the Empire&rsquo;s history, a sizeable force of Shadowlands creatures managed to circumvent the Crab Clan&rsquo;s defenses and penetrate the Empire. Even as the sons of Hida were preparing to pursue them, the creatures disappeared into the vast depths of the Shinomen Mori and were never seen again. Although no human knows of their fate, in fact the creatures disturbed the sleeping Naga within the forest. The serpent men awakened just long enough to eradicate the horde and seal their corrupt influence within a relatively small area. This became a vast, vile, stinking marsh that, while not capable of passing the Taint on to others, remained inherently Tainted itself. The marsh has proven a useful hiding place for the Spider Clan, as no human or denizen of the forest ever ventures within its boundaries.</p>"
    }
  },
  {
    "id" : "G1",
    "name" : "Beiden Pass",
    "type" : "generic",
    "pos" : [214.313720703125, 225.4901885986328],
    "lblPos" : null,
    "provinceId" : "",
    "details": {
      "html" : "<p>The Spine of the World Mountains bisect the Empire, separating northern Rokugan from southern Rokugan with a nearly impenetrable barrier, all but impossible to traverse with any significant military force. Skilled individuals in small numbers can cross the mountains, but larger caravans and military forces must use the few available passes. For the vast majority of the Empire&rsquo;s history, no pass was greater or more often used than Beiden Pass. Called the Crossroads of the Empire, Beiden Pass was the only way to move anything larger than a single legion through the mountains. It was larger by a considerable margin than its closest competitor, the vastly smaller Iuchi Pass in the southern Unicorn lands. Because of this, Beiden Pass was also the site of many great battles through the centuries, most often between the Lion and Scorpion, who controlled the northern and southern ends respectively. In the twelfth century the pass was collapsed upon the spirit armies of the Steel Chrysanthemum, ending the so-called War of Spirits. The pass has never been reopened, but in the late twelfth century the samurai Matsu Hatake discovered a far smaller pass in the same area. Hatake was on a quest to find the men who killed his Scorpion lover, Shamate. He faced and killed the nine men responsible for her demise before succumbing to his wounds. The pass was named in honor of his lost love, and so far has been protected by both the Lion and the Scorpion, a rare display of cooperation that others consider unlikely to last.</p>"
    }
  },
  {
    "id" : "G2",
    "name" : "Black Finger River / River of the Dark Moon",
    "type" : "generic",
    "pos" : [34.882354736328125, 486.8333435058594],
    "lblPos" : null,
    "provinceId" : "",
    "details": {
      "html" : "<p>These two malevolent rivers both branch off from the River of the Last Stand which marks the border of the Crab territories. The two smaller rivers wind through the Shadowlands, and over time have become horribly corrupted and poisonous. The River of the Dark Moon can be navigated and often has been by Hiruma scouts, who regard it as one of the most dangerous stable geographical features within the Shadowlands. The waters are as black as pitch, and terrible deformed plants grow along the banks, many of them aggressive and capable of attacking moving targets. It is said nothing that falls into the waters, not man, creature, or demon, ever emerges. Occasionally, though, things come out of the water, usually dying from exposure to the air but not before inflicting terrible damage on anything nearby. Black Finger River winds deeper into the Shadowlands, and no one who has ever crossed it has returned unscathed. Most do not return at all, and those few who claim to have done so have been clearly mad, so their word cannot be trusted. The Crab regard this river as the point of no return. All samurai must turn back from it and head toward the Empire, or be lost forever.</p>"
    }
  },
  {
    "id" : "G3",
    "name" : "Carpenter Pass",
    "type" : "generic",
    "pos" : [117.5, 514.7941284179688],
    "lblPos" : null,
    "provinceId" : "",
    "details": {
      "html" : "<p>Sometimes referred to as &ldquo;Little Beiden,&rdquo; Carpenter Pass is the largest passage through the southern Twilight Mountains. As such, it is used extensively by the Crab for the movement of troops through their own provinces. The Crab constantly shift forces in their never-ending campaign to keep the Shadowlands at bay, and Carpenter Pass is a major route for those movements. On those occasions when other clans offer to send troops to reinforce the Carpenter Wall, they also send their forces through the pass, giving the Crab ample opportunity to examine them and determine whether or not they are genuine in their desire to help &ndash; and whether or not they actually can be of any help. Because of the importance of their supply lines, the Crab maintain the road through the pass meticulously, ensuring it is one of the finest in the Empire. Much like the road that parallels the Kaiu Wall, the road through the Carpenter Pass is often lined with merchants and vendors, most sponsored by the Yasuki family, attempting to sell their wares to passers-by. Although most other Crab families find this somewhat annoying, the revenue generated by the merchants from outside visitors assists in funding the clan&rsquo;s efforts atop the Wall, so they generally overlook the matter.</p>"
    }
  },
  {
    "id" : "G4",
    "name" : "Dragon Heart Plain",
    "type" : "generic",
    "pos" : [282.17645263671875, 110.31372833251953],
    "lblPos" : null,
    "provinceId" : "",
    "details": {
      "html" : "<p>The vast open plain that separates the Dragon and Phoenix provinces is known as Dragon Heart Plain. Despite the relatively cool climate, the region is quite fertile, and many from the southern provinces find it wasteful that this area has not been cultivated for food production. Those who make this observation are unfamiliar with the area, however, which is well known for its physical eccentricities and spiritual nature. Odd things are sometimes found in the Dragon Heart Plain, things that have no business in the mortal realm, and their presence cannot be accounted for. The ruins of Shiro Chuda, former home of the defunct Snake Clan, are one of the most dangerous and supernaturally active areas in the entire Empire, and many point to these ruins as a perfect example of why the Plain should remain undisturbed, exactly as it has been for centuries.</p>"
    }
  },
  {
    "id" : "G5",
    "name" : "Drowned Merchant River",
    "type" : "generic",
    "pos" : [202.41317749023438, 135.7427215576172],
    "lblPos" : null,
    "provinceId" : "",
    "details": {
      "html" : "<p>This river forms a natural boundary between the Lion provinces and the region generally associated with the Dragon Clan to the north, although the Dragon do not technically control all the lands in question. From the Lion lands on the southern bank, it is possible to see the Dragonfly lands in the distance, just before the foothills of the Dragon Mountains. Some believe it is only the presence of the river that has protected the Dragonfly from the Lion&rsquo;s vengeance, since moving an army across the wide river usually takes long enough for the Dragon to bring troops to defend the Dragonfly. The name of the river comes from an old legend surrounding it. Supposedly, during the dawn of the Empire bandits captured a merchant and his family. The bandits tortured and murdered the family, drowning them in the river. Many believe the vengeful spirit of the merchant still lurks in the water, seeking to punish the guilty. Although educated samurai may dismiss this as superstition, there is no denying that bandits have sometimes been found torn to ribbons with no clear explanation. Peasants claim the merchant&rsquo;s ghost is responsible.</p>"
    }
  },
  {
    "id" : "G6",
    "name" : "Earthquake Fish Bay",
    "type" : "generic",
    "pos" : [210.50979614257812, 530.2156867980957],
    "lblPos" : null,
    "provinceId" : "",
    "details": {
      "html" : "<p>This vast inlet separates the older Crab provinces from those of the Yasuki. Despite the frequently cool weather in this region of the Empire, the waters of the bay are much warmer than one would expect, a result of ongoing volcanic activity beneath the waves. Three times during the Empire&rsquo;s history, a particularly strong earthquake, significantly more powerful than the small tremors that constantly plague the region, has resulted in a massive increase in temperature and killed vast numbers of fish. Although these instances have led to bountiful amounts of fish available in the short term, they also result in poor fishing for the longer term, which the Crab find most unfortunate. Further, these instances have always preceded dire events for the Empire as a whole, so a fish kill in Earthquake Fish Bay is regarded as one of the most ominous of portents.</p>"
    }
  },
  {
    "id" : "G7",
    "name" : "Great Wall of the North / Northern Wall Mountains",
    "type" : "generic",
    "pos" : [244.50979614257812, 39.2156867980957],
    "lblPos" : null,
    "provinceId" : "",
    "details": {
      "html" : "<p>This vast mountain range, known by both names depending upon the area or historical record, serves as the effective northern border of Rokugan. It dominates the entirety of the Dragon Clan provinces (who refer to their own portion of the range as the Dragon Mountains), as well as those of the Badger Clan, and occupies portions of the Ox and Phoenix Clan holdings as well. The mountains of this range are higher than the Spine of the World, and generally colder as well. However, they are more stable than the Spine, making them less dangerous to climb; the elements claim more wayward travelers than do rockslides or cave-ins. For whatever reason, large plateaus are much more common in the Northern Wall Mountains, making them somewhat easier to live in (thankfully, for the Dragon Clan). Beyond the Great Wall are vast steppes, occupied mainly by the various Yobanjin tribes who fled the Empire at its formation. North and west of that lies the vast desert known only as the Burning Sands.</p>"
    }
  },
  {
    "id" : "G8",
    "name" : "Lookout Mountain",
    "type" : "generic",
    "pos" : [200.0602264404297, 196.64468383789062],
    "lblPos" : null,
    "provinceId" : "",
    "details": {
      "html" : "<p>A singular mountain grossly out of place with its surroundings, Lookout Mountain is found in the center of a vast plain in the Lion provinces. Its presence is completely inexplicable, and even shugenja who can commune with the spirits of the earth cannot explain why it stands where it does. The Ikoma records state the mountain simply erupted from the plains during an incredibly powerful but localized earthquake more than a thousand years ago, but this account raises more questions than it answers. What the Lion do not know, and indeed only a handful of people anywhere in the Empire know, is that the mountain was created accidentally when the Phoenix Clan was experimenting with an incredibly powerful magical construct known as Isawa&rsquo;s Last Wish.</p>"
    }
  },
  {
    "id" : "G9",
    "name" : "Mori Isawa",
    "type" : "generic",
    "pos" : [337.8431091308594, 30.588237762451172],
    "lblPos" : null,
    "provinceId" : "",
    "details": {
      "html" : " <p>Although not as large as the expansive Shinomen Mori, the great Isawa forest is probably the largest forest within the Empire proper. It is located entirely within the Phoenix lands, and like its larger counterpart it is an extremely mysterious and spiritual place. Spirits from many different realms have been discovered near the forest. The Phoenix Clan shugenja believe a portal to one or more spirit realms may exist within the forest&rsquo;s confines, but no concerted attempt to local them has been made; the Phoenix consider such an act to be inviting disaster. Wood from the forest is considered the finest in the Empire for the creation of the spell scrolls shugenja use. Because of this, the Isawa do authorize a small amount of wood to be harvested, carefully restricting the quantities to ensure the forest remains viable for many years to come.</p>"
    }
  },
  {
    "id" : "G10",
    "name" : "Plains Above Evil",
    "type" : "generic",
    "pos" : [37.843135833740234, 389.8039245605469],
    "lblPos" : null,
    "provinceId" : "",
    "details": {
      "html" : "<p>A vast and utterly empty wilderness, the Plains Above Evil are so named because they adjoin the Shadowlands to the south. Despite this, the area remains largely desolate, and even the creatures of that dark realm seem reluctant to enter the region. Consequently the Crab lack any significant presence or fortifications in the area, although the Hiruma scouts do keep an eye on the region. In addition to its strange and almost otherworldly emptiness, the area is also home to bizarre ruins that are clearly ancient but do not resemble any currently known pre-human civilizations. The most popular rumor is that they are Naga ruins, and although the serpent men acknowledge it is possible that a failed colony was attempted in the area, they have no concrete knowledge of such a thing.</p>"
    }
  },
  {
    "id" : "G11",
    "name" : "River of Gold",
    "type" : "generic",
    "pos" : [155.88235473632812, 290.9803771972656],
    "lblPos" : null,
    "provinceId" : "",
    "details": {
      "html" : "<p>Through much of the Empire&rsquo;s history this river was used extensively to transport valuable commodities from Scorpion lands to all ports of call along the Rokugani seacoast. Although this trade still exists in modern times, the Scorpion have ceded control of many of the more profitable stretches of the river. Due to the large amounts of trade, pirate activity has always plagued the River of Gold, and in the war-torn twelfth century piracy sometimes rises so dramatically that the river goes unused for years at a time. Although efforts to cleanse the area of pirate influence usually manage to kill large numbers of the criminals, the lure of heavily-laden trade ships soon attracts replacements.</p>"
    }
  },
  {
    "id" : "G12",
    "name" : "River of the Hour of the Wolf",
    "type" : "generic",
    "pos" : [233.5294189453125, 242.7450714111328],
    "lblPos" : null,
    "provinceId" : "",
    "details": {
      "html" : "<p>The River of the Hour of the Wolf is linked to a rare instance of widespread cultural change due to tragedy. It was the site of a battle between the Lion and Scorpion clans that was truly spectacular in scope. The sheer enormity of the forces confronting one another, and the vehemence of their combat, led to a vast number of casualties. It is said that ten thousand samurai died within the span of a single hour, an hour known in that age as the Hour of the Wolf. The river in question, which bore a different name at that time, ran thick and red with the blood of the dead and wounded. The water carried that blood to other settlements and other clan lands, where the horror of what had happened was nearly too great to bear. Countless shugenja exhausted themselves purifying the river, and even today there are those who refuse to drink from it, fearful that some trace of the unclean remains. Due to the widespread horror at this slaughter, the Hour of the Wolf was renamed the Hour of the Dog, while the river was renamed to ensure the terrible battle would never be forgotten.</p>"
    }
  },
  {
    "id" : "G13",
    "name" : "River of the Unexpected Hero",
    "type" : "generic",
    "pos" : [41.3725471496582, 216.47056579589844],
    "lblPos" : null,
    "provinceId" : "",
    "details": {
      "html" : "<p>Celebrated by the Unicorn with an annual festival, this strangely named river is the site of a famous battle waged and won by the Unicorn roughly a century after their return to the Empire. A sizeable force of Shadowlands creatures, having circum- vented the Crab&rsquo;s defenses in the south, threatened the Unicorn Clan&rsquo;s southern provinces in a sudden and violent attack. The Unicorn responded as rapidly as possible, but the advantage of surprise was a powerful one, and the creatures threatened to break the line and lay waste to the clan&rsquo;s innermost holdings. At a crucial moment in the battle, a lone farmer took up the tools of his trade and joined the battle, striking a deadly blow against a vital leader of the creatures. This turned the tide against the Shadowlands, and the Unicorn rallied and were victorious. On at least one day each year, all Unicorn remember the valor of a simple farmer.</p>"
    }
  },
  {
    "id" : "G14",
    "name" : "Seven Day Battle Plain",
    "type" : "battle",
    "pos" : [148.03921508789062, 311.76470947265625],
    "lblPos" : null,
    "provinceId" : "",
    "details": {
      "html" : "<p>This large plain was home to a massive battle between the combined forces of the Emperor&rsquo;s loyal subjects and the vast legion of undead commanded by the dreaded Bloodspeaker, Iuchiban. The battle was lengthy and extremely costly, as every soldier in the Emperor&rsquo;s army who fell to the Bloodspeakers rose again and joined the enemy ranks. Among the many heroes and villains of the day was a ronin warrior named Reichin, a wave man who had previously been a valuable scout against the Bloodspeakers as they advanced upon the city of Ryoko Owari Toshi. When the seven days of battle were over, Iuchiban had been defeated, and for his part in the battle, Reichin was granted leave to found his own Minor Clan, the Hare Clan.</p>"
    }
  },
  {
    "id" : "G15",
    "name" : "Shinomen Mori",
    "type" : "generic",
    "pos" : [103.7254867553711, 286.6666564941406],
    "lblPos" : null,
    "provinceId" : "",
    "details": {
      "html" : "<p>So far as anyone in the Empire knows, the Shinomen Mori is the largest and densest forest in the entire world. It is certainly multiple times larger than any forest within the Empire, and its depths have never been fully explored by any living human soul. Within its vast expanse are hundreds of square miles no man has ever seen. Even the Naga race, who dwell almost entirely within its confines, have never completely explored it or learned all of its mysteries. Those who have studied the enigmas that emerge from the forest believe it may be home to several stable doorways into other spirit realms. Such occurrences are exceedingly rare, but with such a vast area covered by the forest, no one can deny it is possible.</p>"
    }
  },
  {
    "id" : "G16",
    "name" : "Spine of the World Mountains",
    "type" : "generic",
    "pos" : [150.39215087890625, 183.9215545654297],
    "lblPos" : null,
    "provinceId" : "",
    "details": {
      "html" : "<p>The most impenetrable mountain range in the Empire is unquestionably the Spine of the World Mountains, which neatly bisects the Empire and separates half of the Great Clans from their counterparts. Some believe the existence of this mountain range has prevented more wars than any other force, but of course such a claim can never be authenticated. The Spine of the World Mountains are extremely tall, and are less stable than most of the Empire&rsquo;s other ranges. Although there are cultivated regions of the range that have existed without incident for decades or centuries at a time, those who explore the wilder portions of the mountains soon come across areas prone to avalanches and landslides. Only the most experienced mountaineers can traverse the range with impunity.</p>"
    }
  },
  {
    "id" : "G17",
    "name" : "Three Man Alliance Plain",
    "type" : "battle",
    "pos" : [234.7058868408203, 309.8039245605469],
    "lblPos" : null,
    "provinceId" : "",
    "details": {
      "html" : "<p>This relatively unremarkable plain is not particularly fertile or of any significant strategic value, but it is nevertheless a hot spot of the southern Empire because of the boundaries it represents. For centuries the plain marked the border between the Scorpion Clan provinces and the lands controlled by an alliance of three Minor Clans, the Sparrow, the Fox, and the Wasp, known as the Three Man Alliance. The plain was the site of all major confrontations between these two forces. The Scorpion were always vastly superior militarily to the might of even three combined Minor Clans, but the surprising tactics and cooperation of the Three Man Alliance always managed to prevent the Scorpion from eradicating what they considered a minor annoyance in their elaborate schemes. In the twelfth century the Wasp Clan and later the Fox Clan became families within the Great Clan of the Mantis, but they maintained close and cordial relations with the Sparrow, and the emergence of the Minor Clan Alliance meant the Sparrow still did not have to face their Scorpion neighbors alone.</p>"
    }
  },
  {
    "id" : "G18",
    "name" : "Three Sides River",
    "type" : "generic",
    "pos" : [262.941162109375, 241.96075439453125],
    "lblPos" : null,
    "provinceId" : "",
    "details": {
      "html" : "<p>Historically speaking, Three Sides River is the most hotly contested body of water anywhere in the Empire. Because of its location, the river has been claimed at differing times by the Lion, the Crane, and the Scorpion, and it has been a vital component of each clan&rsquo;s trade and commerce in turn. Although the three clans in question are frequently enemies, there have also been long periods of time when the river was considered unaligned and the three grudgingly cooperated in its use. Inevitably, however, one clan eventually attempts to annex the river and the conflicts resume.</p>"
    }
  },
  {
    "id" : "G19",
    "name" : "Tidal Landbridge",
    "type" : "generic",
    "pos" : [217.45098876953125, 500.7843017578125],
    "lblPos" : null,
    "provinceId" : "",
    "details": {
      "html" : "<p>This natural passage is the principle means of crossing Earthquake Fish Bay. It connects the core Crab provinces with the southernmost Yasuki and Crane holdings, including a number of influential Daidoji estates. As befits its name, the landbridge is only above water during low tide, when it can be crossed quickly and without difficulty (other than the mud and slime of the sea bottom). During high tide, however, it is completely submerged by over twenty feet of water, making any manner of crossing completely impossible. During the high tide it is easily possible for ships to pass across the bridge, and traffic through the region is carefully observed and regulated by the Hida on the western edge and the Daidoji on the eastern shore.</p> <p>The landbridge is a site of unusual cooperation between the Hida and the Daidoji due to a famous incident from centuries ago. The third son of the Crab Champion was grievously wounded and the troops under his command threatened with complete eradication by the attack of powerful oni. He survived because the Daidoji daimyo and his hunting party crossed the landbridge and engaged the demon. The Daidoji lord fought until both he and the demons disappeared beneath the waves, allowing the Crab time to evacuate their wounded lord. After the tide receded, only the Daidoji daimyo's helmet could be found, and ever since the Hida have reverently maintained a shrine to his memory on the western shore of the landbridge.</p>"
    }
  },
  {
    "id" : "G20",
    "name" : "Techerous Path & the Mountains of Regret",
    "type" : "generic",
    "pos" : [271.9607849121094, 104.70587921142578],
    "lblPos" : null,
    "provinceId" : "",
    "details": {
      "html" : "<p>This dangerous pass is the only major route through the Mountains of Regret, a small mountain range, perhaps more of an outcropping, located north of Otosan Uchi. The mountains separate the Phoenix Clan provinces from the Imperial City, and mostly lie outside the boundaries of any clan's holdings. The Phoenix have several significant holdings immediately north of the pass, and the Mantis hold sway over the formerly unaligned Dragon's Guard City at the southern end, but there are no major settlements or holdings along the length of the route itself. Perhaps for this reason, they are unsettled and known to be particularly dangerous. The cycle of freezing and thawing of the ice atop the peaks causes frequent landslides, and there have been intermittent reports of goblins and ogres in the area for centuries. Some shugenja theorize there is a hidden breeding ground for these creatures somewhere deep within the caves and valleys of the mountains, but even the most dedicated searches have never been able to locate them.</p>"
    }
  },
  {
    "id" : "G21",
    "name" : "Twilight Mountains",
    "type" : "generic",
    "pos" : [137.84312438964844, 494.9019470214844],
    "lblPos" : null,
    "provinceId" : "",
    "details": {
      "html" : "<p>One of the southernmost mountain ranges in Rokugan is perhaps also the oldest, and has lower and less jagged peaks than the Spine of the World or the Northern Wall ranges. Generally speaking, however, this means the crags and valleys are deeper as well, and strange things often hide within their recesses.</p>"
    }
  },
  {
    "id" : "G22",
    "name" : "Valley of Two Generals",
    "type" : "battle",
    "pos" : [282.8053283691406, 138.60546875],
    "lblPos" : null,
    "provinceId" : "",
    "details": {
      "html" : "<p>This is the site of one of the greatest battles between the Lion and Crane, two clans that have been at odds for the majority of the Empire&rsquo;s history. The previously unnamed valley was the battleground for an entire Lion army that faced off against an equal number of troops from the Crane Clan provinces, making it one of the largest engagements to take place between the third and eleventh centuries. The battle raged for seven days, waxing and waning over that period of time, and thousands lost their lives. At the battle&rsquo;s conclusion, the Matsu general faced the Kakita general in personal combat and, although the Matsu was victorious, she succumbed to her wounds only moments later. The honor and sacrifice of the two officers was enough to end the battle, and both clans would later cooperate in erecting a shrine to their memory within the valley.</p>"
    }
  },
  {
    "id" : "G23",
    "name" : "Wall Above the Ocean",
    "type" : "generic",
    "pos" : [203.72549438476562, 483.13726806640625],
    "lblPos" : null,
    "provinceId" : "",
    "details": {
      "html" : "<p>Although some consider these mountains part of the Twilight Mountain range, many records identify them as a separate range. Even smaller than the Mountains of Regret, the Wall Above the Ocean mountains are completely unremarkable, and serve largely as a natural barrier between the Crab and Crane holdings.</p>"
    }
  },
  {
    "id" : "G24",
    "name" : "White Short Plain",
    "type" : "battle",
    "pos" : [63.6274528503418, 192.74510192871094],
    "lblPos" : null,
    "provinceId" : "",
    "details": {
      "html" : "<p>White Shore Plain is where the armies of the Unicorn Clan, only days after reentering the Empire, faced the army of the Scorpion Clan on the field of battle. The fighting was intense, but the unexpected power of the Unicorn cavalry won the day and the Scorpion were handily defeated. Very shortly after the battle&rsquo;s conclusion, word came from the Imperial City that the Unicorn had proven their claim to be the descendents of the Ki-Rin Clan and, with sponsorship from the Crane, had been accepted by the Emperor as a Great Clan.</p>"
    }
  }
]



